fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
/* AVR32-specific support for 32-bit ELF.
   Copyright 2003,2004,2005,2006,2007,2008,2009 Atmel Corporation.

   Written by Haavard Skinnemoen, Atmel Norway, <hskinnemoen@atmel.com>

   This file is part of BFD, the Binary File Descriptor library.

   This program is free software; you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation; either version 2 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program; if not, write to the Free Software
   Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA. */

#include "bfd.h"
#include "sysdep.h"
#include "bfdlink.h"
#include "libbfd.h"
#include "elf-bfd.h"
#include "elf/avr32.h"
#include "elf32-avr32.h"

#define xDEBUG
#define xRELAX_DEBUG

#ifdef DEBUG
# define pr_debug(fmt, args...) fprintf(stderr, fmt, ##args)
#else
# define pr_debug(fmt, args...) do { } while (0)
#endif

#ifdef RELAX_DEBUG
# define RDBG(fmt, args...) fprintf(stderr, fmt, ##args)
#else
# define RDBG(fmt, args...) do { } while (0)
#endif

/* When things go wrong, we want it to blow up, damnit! */
#undef BFD_ASSERT
#undef abort
#define BFD_ASSERT(expr)					\
  do								\
    {								\
      if (!(expr))						\
	{							\
	  bfd_assert(__FILE__, __LINE__);			\
	  abort();						\
	}							\
    }								\
  while (0)

/* The name of the dynamic interpreter. This is put in the .interp section. */
#define ELF_DYNAMIC_INTERPRETER		"/lib/ld.so.1"

#define AVR32_GOT_HEADER_SIZE		8
#define AVR32_FUNCTION_STUB_SIZE	8

#define ELF_R_INFO(x, y) ELF32_R_INFO(x, y)
#define ELF_R_TYPE(x) ELF32_R_TYPE(x)
#define ELF_R_SYM(x) ELF32_R_SYM(x)

#define NOP_OPCODE 0xd703


/* Mapping between BFD relocations and ELF relocations */

static reloc_howto_type *
bfd_elf32_bfd_reloc_type_lookup(bfd *abfd, bfd_reloc_code_real_type code);

static reloc_howto_type *
bfd_elf32_bfd_reloc_name_lookup(bfd *abfd, const char *r_name);

static void
avr32_info_to_howto (bfd *abfd, arelent *cache_ptr, Elf_Internal_Rela *dst);

/* Generic HOWTO */
#define GENH(name, align, size, bitsize, pcrel, bitpos, complain, mask)	\
  HOWTO(name, align, size, bitsize, pcrel, bitpos,			\
	complain_overflow_##complain, bfd_elf_generic_reloc, #name,	\
	FALSE, 0, mask, pcrel)

static reloc_howto_type elf_avr32_howto_table[] = {
  /*   NAME		 ALN SZ BSZ PCREL  BP COMPLAIN  MASK	    */
  GENH(R_AVR32_NONE,	  0, 0, 0,  FALSE, 0, dont,	0x00000000),

  GENH(R_AVR32_32,	  0, 2, 32, FALSE, 0, dont,	0xffffffff),
  GENH(R_AVR32_16,	  0, 1, 16, FALSE, 0, bitfield,	0x0000ffff),
  GENH(R_AVR32_8,	  0, 0,  8, FALSE, 0, bitfield,	0x000000ff),
  GENH(R_AVR32_32_PCREL,  0, 2, 32, TRUE,  0, signed,   0xffffffff),
  GENH(R_AVR32_16_PCREL,  0, 1, 16, TRUE,  0, signed,   0x0000ffff),
  GENH(R_AVR32_8_PCREL,	  0, 0,  8, TRUE,  0, signed,   0x000000ff),

  /* Difference between two symbol (sym2 - sym1).  The reloc encodes
     the value of sym1.  The field contains the difference before any
     relaxing is done.  */
  GENH(R_AVR32_DIFF32,	  0, 2, 32, FALSE, 0, dont,	0xffffffff),
  GENH(R_AVR32_DIFF16,	  0, 1, 16, FALSE, 0, signed,	0x0000ffff),
  GENH(R_AVR32_DIFF8,	  0, 0,  8, FALSE, 0, signed,	0x000000ff),

  GENH(R_AVR32_GOT32,	  0, 2, 32, FALSE, 0, signed,	0xffffffff),
  GENH(R_AVR32_GOT16,	  0, 1, 16, FALSE, 0, signed,	0x0000ffff),
  GENH(R_AVR32_GOT8,	  0, 0,  8, FALSE, 0, signed,	0x000000ff),

  GENH(R_AVR32_21S,	  0, 2, 21, FALSE, 0, signed,	0x1e10ffff),
  GENH(R_AVR32_16U,	  0, 2, 16, FALSE, 0, unsigned,	0x0000ffff),
  GENH(R_AVR32_16S,	  0, 2, 16, FALSE, 0, signed,	0x0000ffff),
  GENH(R_AVR32_8S,	  0, 1,  8, FALSE, 4, signed,	0x00000ff0),
  GENH(R_AVR32_8S_EXT,	  0, 2,  8, FALSE, 0, signed,	0x000000ff),

  GENH(R_AVR32_22H_PCREL, 1, 2, 21, TRUE,  0, signed,	0x1e10ffff),
  GENH(R_AVR32_18W_PCREL, 2, 2, 16, TRUE,  0, signed,	0x0000ffff),
  GENH(R_AVR32_16B_PCREL, 0, 2, 16, TRUE,  0, signed,	0x0000ffff),
  GENH(R_AVR32_16N_PCREL, 0, 2, 16, TRUE,  0, signed,	0x0000ffff),
  GENH(R_AVR32_14UW_PCREL, 2, 2, 12, TRUE, 0, unsigned, 0x0000f0ff),
  GENH(R_AVR32_11H_PCREL, 1, 1, 10, TRUE,  4, signed,	0x00000ff3),
  GENH(R_AVR32_10UW_PCREL, 2, 2, 8, TRUE,  0, unsigned, 0x000000ff),
  GENH(R_AVR32_9H_PCREL,  1, 1,  8, TRUE,  4, signed,	0x00000ff0),
  GENH(R_AVR32_9UW_PCREL, 2, 1,  7, TRUE,  4, unsigned,	0x000007f0),

  GENH(R_AVR32_HI16,	 16, 2, 16, FALSE, 0, dont,	0x0000ffff),
  GENH(R_AVR32_LO16,	  0, 2, 16, FALSE, 0, dont,	0x0000ffff),

  GENH(R_AVR32_GOTPC,	  0, 2, 32, FALSE, 0, dont,	0xffffffff),
  GENH(R_AVR32_GOTCALL,   2, 2, 21, FALSE, 0, signed,	0x1e10ffff),
  GENH(R_AVR32_LDA_GOT,	  2, 2, 21, FALSE, 0, signed,	0x1e10ffff),
  GENH(R_AVR32_GOT21S,	  0, 2, 21, FALSE, 0, signed,	0x1e10ffff),
  GENH(R_AVR32_GOT18SW,	  2, 2, 16, FALSE, 0, signed,	0x0000ffff),
  GENH(R_AVR32_GOT16S,	  0, 2, 16, FALSE, 0, signed,	0x0000ffff),
  GENH(R_AVR32_GOT7UW,	  2, 1,  5, FALSE, 4, unsigned, 0x000001f0),

  GENH(R_AVR32_32_CPENT,  0, 2, 32, FALSE, 0, dont,	0xffffffff),
  GENH(R_AVR32_CPCALL,	  2, 2, 16, TRUE,  0, signed,	0x0000ffff),
  GENH(R_AVR32_16_CP,	  0, 2, 16, TRUE,  0, signed,	0x0000ffff),
  GENH(R_AVR32_9W_CP,	  2, 1,  7, TRUE,  4, unsigned, 0x000007f0),

  GENH(R_AVR32_RELATIVE,  0, 2, 32, FALSE, 0, signed,	0xffffffff),
  GENH(R_AVR32_GLOB_DAT,  0, 2, 32, FALSE, 0, dont,	0xffffffff),
  GENH(R_AVR32_JMP_SLOT,  0, 2, 32, FALSE, 0, dont,	0xffffffff),

  GENH(R_AVR32_ALIGN,	  0, 1, 0,  FALSE, 0, unsigned, 0x00000000),

  GENH(R_AVR32_15S,	  2, 2, 15, FALSE, 0, signed,	0x00007fff),
};

struct elf_reloc_map
{
  bfd_reloc_code_real_type bfd_reloc_val;
  unsigned char elf_reloc_val;
};

static const struct elf_reloc_map avr32_reloc_map[] =
{
  { BFD_RELOC_NONE,			R_AVR32_NONE },

  { BFD_RELOC_32,			R_AVR32_32 },
  { BFD_RELOC_16,			R_AVR32_16 },
  { BFD_RELOC_8,			R_AVR32_8 },
  { BFD_RELOC_32_PCREL,			R_AVR32_32_PCREL },
  { BFD_RELOC_16_PCREL,			R_AVR32_16_PCREL },
  { BFD_RELOC_8_PCREL,			R_AVR32_8_PCREL },
  { BFD_RELOC_AVR32_DIFF32,		R_AVR32_DIFF32 },
  { BFD_RELOC_AVR32_DIFF16,		R_AVR32_DIFF16 },
  { BFD_RELOC_AVR32_DIFF8,		R_AVR32_DIFF8 },
  { BFD_RELOC_AVR32_GOT32,		R_AVR32_GOT32 },
  { BFD_RELOC_AVR32_GOT16,		R_AVR32_GOT16 },
  { BFD_RELOC_AVR32_GOT8,		R_AVR32_GOT8 },

