fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
  { BFD_RELOC_AVR32_21S,		R_AVR32_21S },
  { BFD_RELOC_AVR32_16U,		R_AVR32_16U },
  { BFD_RELOC_AVR32_16S,		R_AVR32_16S },
  { BFD_RELOC_AVR32_SUB5,		R_AVR32_16S },
  { BFD_RELOC_AVR32_8S_EXT,		R_AVR32_8S_EXT },
  { BFD_RELOC_AVR32_8S,			R_AVR32_8S },

  { BFD_RELOC_AVR32_22H_PCREL,		R_AVR32_22H_PCREL },
  { BFD_RELOC_AVR32_18W_PCREL,		R_AVR32_18W_PCREL },
  { BFD_RELOC_AVR32_16B_PCREL,		R_AVR32_16B_PCREL },
  { BFD_RELOC_AVR32_16N_PCREL,		R_AVR32_16N_PCREL },
  { BFD_RELOC_AVR32_11H_PCREL,		R_AVR32_11H_PCREL },
  { BFD_RELOC_AVR32_10UW_PCREL,		R_AVR32_10UW_PCREL },
  { BFD_RELOC_AVR32_9H_PCREL,		R_AVR32_9H_PCREL },
  { BFD_RELOC_AVR32_9UW_PCREL,		R_AVR32_9UW_PCREL },

  { BFD_RELOC_HI16,			R_AVR32_HI16 },
  { BFD_RELOC_LO16,			R_AVR32_LO16 },

  { BFD_RELOC_AVR32_GOTPC,		R_AVR32_GOTPC },
  { BFD_RELOC_AVR32_GOTCALL,		R_AVR32_GOTCALL },
  { BFD_RELOC_AVR32_LDA_GOT,		R_AVR32_LDA_GOT },
  { BFD_RELOC_AVR32_GOT21S,		R_AVR32_GOT21S },
  { BFD_RELOC_AVR32_GOT18SW,		R_AVR32_GOT18SW },
  { BFD_RELOC_AVR32_GOT16S,		R_AVR32_GOT16S },
  /* GOT7UW should never be generated by the assembler */

  { BFD_RELOC_AVR32_32_CPENT,		R_AVR32_32_CPENT },
  { BFD_RELOC_AVR32_CPCALL,		R_AVR32_CPCALL },
  { BFD_RELOC_AVR32_16_CP,		R_AVR32_16_CP },
  { BFD_RELOC_AVR32_9W_CP,		R_AVR32_9W_CP },

  { BFD_RELOC_AVR32_ALIGN,		R_AVR32_ALIGN },

  { BFD_RELOC_AVR32_15S,		R_AVR32_15S },
};

static reloc_howto_type *
bfd_elf32_bfd_reloc_type_lookup (bfd *abfd ATTRIBUTE_UNUSED,
				 bfd_reloc_code_real_type code)
{
  unsigned int i;

  for (i = 0; i < sizeof(avr32_reloc_map) / sizeof(struct elf_reloc_map); i++)
    {
      if (avr32_reloc_map[i].bfd_reloc_val == code)
	return &elf_avr32_howto_table[avr32_reloc_map[i].elf_reloc_val];
    }

  return NULL;
}

static reloc_howto_type *
bfd_elf32_bfd_reloc_name_lookup (bfd *abfd ATTRIBUTE_UNUSED,
                 const char *r_name)
{
  unsigned int i;

  for (i = 0;
       i < sizeof (elf_avr32_howto_table) / sizeof (elf_avr32_howto_table[0]);
       i++)
    if (elf_avr32_howto_table[i].name != NULL
    && strcasecmp (elf_avr32_howto_table[i].name, r_name) == 0)
      return &elf_avr32_howto_table[i];

  return NULL;
}

/* Set the howto pointer for an AVR32 ELF reloc.  */
static void
avr32_info_to_howto (bfd *abfd ATTRIBUTE_UNUSED,
		     arelent *cache_ptr,
		     Elf_Internal_Rela *dst)
{
  unsigned int r_type;

  r_type = ELF32_R_TYPE (dst->r_info);
  BFD_ASSERT (r_type < (unsigned int) R_AVR32_max);
  cache_ptr->howto = &elf_avr32_howto_table[r_type];
}


/* AVR32 ELF linker hash table and associated hash entries. */

static struct bfd_hash_entry *
avr32_elf_link_hash_newfunc(struct bfd_hash_entry *entry,
			    struct bfd_hash_table *table,
			    const char *string);
static void
avr32_elf_copy_indirect_symbol(struct bfd_link_info *info,
			       struct elf_link_hash_entry *dir,
			       struct elf_link_hash_entry *ind);
static struct bfd_link_hash_table *
avr32_elf_link_hash_table_create(bfd *abfd);

/*
  Try to limit memory usage to something reasonable when sorting the
  GOT.  If just a couple of entries end up getting more references
  than this, it won't affect performance at all, but if there are many
  of them, we could end up with the wrong symbols being assigned the
  first GOT entries.
*/
#define MAX_NR_GOT_HOLES	2048

/*
  AVR32 GOT entry.  We need to keep track of refcounts and offsets
  simultaneously, since we need the offsets during relaxation, and we
  also want to be able to drop GOT entries during relaxation. In
  addition to this, we want to keep the list of GOT entries sorted so
  that we can keep the most-used entries at the lowest offsets.
*/
struct got_entry
{
  struct got_entry *next;
  struct got_entry **pprev;
  int refcount;
  bfd_signed_vma offset;
};

struct elf_avr32_link_hash_entry
{
  struct elf_link_hash_entry root;

  /* Number of runtime relocations against this symbol.  */
  unsigned int possibly_dynamic_relocs;

  /* If there are anything but R_AVR32_GOT18 relocations against this
     symbol, it means that someone may be taking the address of the
     function, and we should therefore not create a stub.  */
  bfd_boolean no_fn_stub;

  /* If there is a R_AVR32_32 relocation in a read-only section
     against this symbol, we could be in trouble. If we're linking a
     shared library or this symbol is defined in one, it means we must
     emit a run-time reloc for it and that's not allowed in read-only
     sections.  */
  asection *readonly_reloc_sec;
  bfd_vma readonly_reloc_offset;

  /* Record which frag (if any) contains the symbol.  This is used
     during relaxation in order to avoid having to update all symbols
     whenever we move something.  For local symbols, this information
     is in the local_sym_frag member of struct elf_obj_tdata.  */
  struct fragment *sym_frag;
};
#define avr32_elf_hash_entry(ent) ((struct elf_avr32_link_hash_entry *)(ent))

struct elf_avr32_link_hash_table
{
  struct elf_link_hash_table root;

  /* Shortcuts to get to dynamic linker sections.  */
  asection *sgot;
  asection *srelgot;
  asection *sstub;

  /* We use a variation of Pigeonhole Sort to sort the GOT.  After the
     initial refcounts have been determined, we initialize
     nr_got_holes to the highest refcount ever seen and allocate an
     array of nr_got_holes entries for got_hole.  Each GOT entry is
     then stored in this array at the index given by its refcount.

     When a GOT entry has its refcount decremented during relaxation,
     it is moved to a lower index in the got_hole array.
   */
  struct got_entry **got_hole;
  int nr_got_holes;

  /* Dynamic relocations to local symbols.  Only used when linking a
     shared library and -Bsymbolic is not given.  */
  unsigned int local_dynamic_relocs;

  bfd_boolean relocations_analyzed;
  bfd_boolean symbols_adjusted;
  bfd_boolean repeat_pass;
  bfd_boolean direct_data_refs;
  unsigned int relax_iteration;
  unsigned int relax_pass;
};
#define avr32_elf_hash_table(p)				\
  ((struct elf_avr32_link_hash_table *)((p)->hash))

