fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
static struct bfd_hash_entry *
avr32_elf_link_hash_newfunc(struct bfd_hash_entry *entry,
			    struct bfd_hash_table *table,
			    const char *string)
{
  struct elf_avr32_link_hash_entry *ret = avr32_elf_hash_entry(entry);

  /* Allocate the structure if it hasn't already been allocated by a
     subclass */
  if (ret == NULL)
    ret = (struct elf_avr32_link_hash_entry *)
      bfd_hash_allocate(table, sizeof(struct elf_avr32_link_hash_entry));

  if (ret == NULL)
    return NULL;

  memset(ret, 0, sizeof(struct elf_avr32_link_hash_entry));

  /* Give the superclass a chance */
  ret = (struct elf_avr32_link_hash_entry *)
    _bfd_elf_link_hash_newfunc((struct bfd_hash_entry *)ret, table, string);

  return (struct bfd_hash_entry *)ret;
}

/* Copy data from an indirect symbol to its direct symbol, hiding the
   old indirect symbol.  Process additional relocation information.
   Also called for weakdefs, in which case we just let
   _bfd_elf_link_hash_copy_indirect copy the flags for us.  */

static void
avr32_elf_copy_indirect_symbol(struct bfd_link_info *info,
			       struct elf_link_hash_entry *dir,
			       struct elf_link_hash_entry *ind)
{
  struct elf_avr32_link_hash_entry *edir, *eind;

  _bfd_elf_link_hash_copy_indirect (info, dir, ind);

  if (ind->root.type != bfd_link_hash_indirect)
    return;

  edir = (struct elf_avr32_link_hash_entry *)dir;
  eind = (struct elf_avr32_link_hash_entry *)ind;

  edir->possibly_dynamic_relocs += eind->possibly_dynamic_relocs;
  edir->no_fn_stub = edir->no_fn_stub || eind->no_fn_stub;
}

static struct bfd_link_hash_table *
avr32_elf_link_hash_table_create(bfd *abfd)
{
  struct elf_avr32_link_hash_table *ret;

  ret = bfd_zmalloc(sizeof(*ret));
  if (ret == NULL)
    return NULL;

  if (! _bfd_elf_link_hash_table_init(&ret->root, abfd,
				      avr32_elf_link_hash_newfunc,
                      sizeof (struct elf_avr32_link_hash_entry)))
    {
      free(ret);
      return NULL;
    }

  /* Prevent the BFD core from creating bogus got_entry pointers */
  ret->root.init_got_refcount.glist = NULL;
  ret->root.init_plt_refcount.glist = NULL;
  ret->root.init_got_offset.glist = NULL;
  ret->root.init_plt_offset.glist = NULL;

  return &ret->root.root;
}


/* Initial analysis and creation of dynamic sections and symbols */

static asection *
create_dynamic_section(bfd *dynobj, const char *name, flagword flags,
		       unsigned int align_power);
static struct elf_link_hash_entry *
create_dynamic_symbol(bfd *dynobj, struct bfd_link_info *info,
		      const char *name, asection *sec,
		      bfd_vma offset);
static bfd_boolean
avr32_elf_create_got_section (bfd *dynobj, struct bfd_link_info *info);
static bfd_boolean
avr32_elf_create_dynamic_sections (bfd *dynobj, struct bfd_link_info *info);
static bfd_boolean
avr32_check_relocs (bfd *abfd, struct bfd_link_info *info, asection *sec,
		    const Elf_Internal_Rela *relocs);
static bfd_boolean
avr32_elf_adjust_dynamic_symbol(struct bfd_link_info *info,
				struct elf_link_hash_entry *h);

static asection *
create_dynamic_section(bfd *dynobj, const char *name, flagword flags,
		       unsigned int align_power)
{
  asection *sec;

  sec = bfd_make_section(dynobj, name);
  if (!sec
      || !bfd_set_section_flags(dynobj, sec, flags)
      || !bfd_set_section_alignment(dynobj, sec, align_power))
    return NULL;

  return sec;
}

static struct elf_link_hash_entry *
create_dynamic_symbol(bfd *dynobj, struct bfd_link_info *info,
		      const char *name, asection *sec,
		      bfd_vma offset)
{
  struct bfd_link_hash_entry *bh = NULL;
  struct elf_link_hash_entry *h;
  const struct elf_backend_data *bed = get_elf_backend_data (dynobj);

  if (!(_bfd_generic_link_add_one_symbol
	(info, dynobj, name, BSF_GLOBAL, sec, offset, NULL, FALSE,
	 bed->collect, &bh)))
    return NULL;

  h = (struct elf_link_hash_entry *)bh;
  h->def_regular = 1;
  h->type = STT_OBJECT;
  h->other = STV_HIDDEN;

  return h;
}

static bfd_boolean
avr32_elf_create_got_section (bfd *dynobj, struct bfd_link_info *info)
{
  struct elf_avr32_link_hash_table *htab;
  flagword flags;
  const struct elf_backend_data *bed = get_elf_backend_data (dynobj);

  htab = avr32_elf_hash_table(info);
  flags = bed->dynamic_sec_flags;

  if (htab->sgot)
    return TRUE;

  htab->sgot = create_dynamic_section(dynobj, ".got", flags, 2);
  if (!htab->srelgot)
    htab->srelgot = create_dynamic_section(dynobj, ".rela.got",
					   flags | SEC_READONLY, 2);

  if (!htab->sgot || !htab->srelgot)
    return FALSE;

  htab->root.hgot = create_dynamic_symbol(dynobj, info, "_GLOBAL_OFFSET_TABLE_",
					  htab->sgot, 0);
  if (!htab->root.hgot)
    return FALSE;

  /* Make room for the GOT header */
  htab->sgot->size += bed->got_header_size;

  return TRUE;
}

/* (1) Create all dynamic (i.e. linker generated) sections that we may
   need during the link */

static bfd_boolean
avr32_elf_create_dynamic_sections (bfd *dynobj, struct bfd_link_info *info)
{
  struct elf_avr32_link_hash_table *htab;
  flagword flags;
  const struct elf_backend_data *bed = get_elf_backend_data (dynobj);

  pr_debug("(1) create dynamic sections\n");

  htab = avr32_elf_hash_table(info);
  flags = bed->dynamic_sec_flags;

  if (!avr32_elf_create_got_section (dynobj, info))
    return FALSE;

  if (!htab->sstub)
    htab->sstub = create_dynamic_section(dynobj, ".stub",
					 flags | SEC_READONLY | SEC_CODE, 2);

  if (!htab->sstub)
    return FALSE;

  return TRUE;
}

/* (2) Go through all the relocs and count any potential GOT- or
   PLT-references to each symbol */

static bfd_boolean
avr32_check_relocs (bfd *abfd, struct bfd_link_info *info, asection *sec,
		    const Elf_Internal_Rela *relocs)
{
  Elf_Internal_Shdr *symtab_hdr;
  struct elf_avr32_link_hash_table *htab;
  struct elf_link_hash_entry **sym_hashes;
  const Elf_Internal_Rela *rel, *rel_end;
  struct got_entry **local_got_ents;
  struct got_entry *got;
  const struct elf_backend_data *bed = get_elf_backend_data (abfd);
  asection *sgot;
  bfd *dynobj;

  pr_debug("(2) check relocs for %s:<%s> (size 0x%lx)\n",
	   abfd->filename, sec->name, sec->size);

  if (info->relocatable)
    return TRUE;

  dynobj = elf_hash_table(info)->dynobj;
  symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
  sym_hashes = elf_sym_hashes(abfd);
  htab = avr32_elf_hash_table(info);
  local_got_ents = elf_local_got_ents(abfd);
  sgot = htab->sgot;

  rel_end = relocs + sec->reloc_count;
  for (rel = relocs; rel < rel_end; rel++)
    {
      unsigned long r_symndx, r_type;
      struct elf_avr32_link_hash_entry *h;

