fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
      r_symndx = ELF32_R_SYM(rel->r_info);
      r_type = ELF32_R_TYPE(rel->r_info);

      /* Local symbols use local_got_ents, while others store the same
	 information in the hash entry */
      if (r_symndx < symtab_hdr->sh_info)
	{
	  pr_debug("  (2a) processing local symbol %lu\n", r_symndx);
	  h = NULL;
	}
      else
	{
	  h = (struct elf_avr32_link_hash_entry *)
	    sym_hashes[r_symndx - symtab_hdr->sh_info];
	  while (h->root.type == bfd_link_hash_indirect
		 || h->root.type == bfd_link_hash_warning)
	    h = (struct elf_avr32_link_hash_entry *)h->root.root.u.i.link;
	  pr_debug("  (2a) processing symbol %s\n", h->root.root.root.string);
	}

      /* Some relocs require special sections to be created.  */
      switch (r_type)
	{
	case R_AVR32_GOT32:
	case R_AVR32_GOT16:
	case R_AVR32_GOT8:
	case R_AVR32_GOT21S:
	case R_AVR32_GOT18SW:
	case R_AVR32_GOT16S:
	case R_AVR32_GOT7UW:
	case R_AVR32_LDA_GOT:
	case R_AVR32_GOTCALL:
	  if (rel->r_addend)
	    {
	      if (info->callbacks->reloc_dangerous
		  (info, _("Non-zero addend on GOT-relative relocation"),
		   abfd, sec, rel->r_offset) == FALSE)
		return FALSE;
	    }
	  /* fall through */
	case R_AVR32_GOTPC:
	  if (dynobj == NULL)
	    elf_hash_table(info)->dynobj = dynobj = abfd;
	  if (sgot == NULL && !avr32_elf_create_got_section(dynobj, info))
	    return FALSE;
	  break;
	case R_AVR32_32:
	  /* We may need to create .rela.dyn later on.  */
	  if (dynobj == NULL
	      && (info->shared || h != NULL)
	      && (sec->flags & SEC_ALLOC))
	    elf_hash_table(info)->dynobj = dynobj = abfd;
	  break;
	}

      if (h != NULL && r_type != R_AVR32_GOT18SW)
	h->no_fn_stub = TRUE;

      switch (r_type)
	{
	case R_AVR32_GOT32:
	case R_AVR32_GOT16:
	case R_AVR32_GOT8:
	case R_AVR32_GOT21S:
	case R_AVR32_GOT18SW:
	case R_AVR32_GOT16S:
	case R_AVR32_GOT7UW:
	case R_AVR32_LDA_GOT:
	case R_AVR32_GOTCALL:
	  if (h != NULL)
	    {
	      got = h->root.got.glist;
	      if (!got)
		{
		  got = bfd_zalloc(abfd, sizeof(struct got_entry));
		  if (!got)
		    return FALSE;
		  h->root.got.glist = got;
		}
	    }
	  else
	    {
	      if (!local_got_ents)
		{
		  bfd_size_type size;
		  bfd_size_type i;
		  struct got_entry *tmp_entry;

		  size = symtab_hdr->sh_info;
		  size *= sizeof(struct got_entry *) + sizeof(struct got_entry);
		  local_got_ents = bfd_zalloc(abfd, size);
		  if (!local_got_ents)
		    return FALSE;

		  elf_local_got_ents(abfd) = local_got_ents;

		  tmp_entry = (struct got_entry *)(local_got_ents
						   + symtab_hdr->sh_info);
		  for (i = 0; i < symtab_hdr->sh_info; i++)
		    local_got_ents[i] = &tmp_entry[i];
		}

	      got = local_got_ents[r_symndx];
	    }

	  got->refcount++;
	  if (got->refcount > htab->nr_got_holes)
	    htab->nr_got_holes = got->refcount;
	  break;

	case R_AVR32_32:
	  if ((info->shared || h != NULL)
	      && (sec->flags & SEC_ALLOC))
	    {
	      if (htab->srelgot == NULL)
		{
		  htab->srelgot = create_dynamic_section(dynobj, ".rela.got",
							 bed->dynamic_sec_flags
							 | SEC_READONLY, 2);
		  if (htab->srelgot == NULL)
		    return FALSE;
		}

	      if (sec->flags & SEC_READONLY
		  && !h->readonly_reloc_sec)
		{
		  h->readonly_reloc_sec = sec;
		  h->readonly_reloc_offset = rel->r_offset;
		}

	      if (h != NULL)
		{
		  pr_debug("Non-GOT reference to symbol %s\n",
			   h->root.root.root.string);
		  h->possibly_dynamic_relocs++;
		}
	      else
		{
		  pr_debug("Non-GOT reference to local symbol %lu\n",
			   r_symndx);
		  htab->local_dynamic_relocs++;
		}
	    }

	  break;

	  /* TODO: GNU_VTINHERIT and GNU_VTENTRY */
	}
    }

  return TRUE;
}

/* (3) Adjust a symbol defined by a dynamic object and referenced by a
   regular object.  The current definition is in some section of the
   dynamic object, but we're not including those sections.  We have to
   change the definition to something the rest of the link can
   understand.  */

static bfd_boolean
avr32_elf_adjust_dynamic_symbol(struct bfd_link_info *info,
				struct elf_link_hash_entry *h)
{
  struct elf_avr32_link_hash_table *htab;
  struct elf_avr32_link_hash_entry *havr;
  bfd *dynobj;

  pr_debug("(3) adjust dynamic symbol %s\n", h->root.root.string);

  htab = avr32_elf_hash_table(info);
  havr = (struct elf_avr32_link_hash_entry *)h;
  dynobj = elf_hash_table(info)->dynobj;

  /* Make sure we know what is going on here.  */
  BFD_ASSERT (dynobj != NULL
	      && (h->u.weakdef != NULL
		  || (h->def_dynamic
		      && h->ref_regular
		      && !h->def_regular)));

  /* We don't want dynamic relocations in read-only sections. */
  if (havr->readonly_reloc_sec)
    {
      if (info->callbacks->reloc_dangerous
	  (info, _("dynamic relocation in read-only section"),
	   havr->readonly_reloc_sec->owner, havr->readonly_reloc_sec,
	   havr->readonly_reloc_offset) == FALSE)
	return FALSE;
    }

  /* If this is a function, create a stub if possible and set the
     symbol to the stub location.  */
  if (0 && !havr->no_fn_stub)
    {
      if (!h->def_regular)
	{
	  asection *s = htab->sstub;

	  BFD_ASSERT(s != NULL);

	  h->root.u.def.section = s;
	  h->root.u.def.value = s->size;
	  h->plt.offset = s->size;
	  s->size += AVR32_FUNCTION_STUB_SIZE;

	  return TRUE;
	}
    }
  else if (h->type == STT_FUNC)
    {
      /* This will set the entry for this symbol in the GOT to 0, and
	 the dynamic linker will take care of this. */
      h->root.u.def.value = 0;
      return TRUE;
    }

  /* If this is a weak symbol, and there is a real definition, the
     processor independent code will have arranged for us to see the
     real definition first, and we can just use the same value.  */
  if (h->u.weakdef != NULL)
    {
      BFD_ASSERT(h->u.weakdef->root.type == bfd_link_hash_defined
		 || h->u.weakdef->root.type == bfd_link_hash_defweak);
      h->root.u.def.section = h->u.weakdef->root.u.def.section;
      h->root.u.def.value = h->u.weakdef->root.u.def.value;
      return TRUE;
    }

  /* This is a reference to a symbol defined by a dynamic object which
     is not a function.  */

