fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
  return TRUE;
}


/* Garbage-collection of unused sections */

static asection *
avr32_elf_gc_mark_hook(asection *sec,
		       struct bfd_link_info *info ATTRIBUTE_UNUSED,
		       Elf_Internal_Rela *rel,
		       struct elf_link_hash_entry *h,
		       Elf_Internal_Sym *sym)
{
  if (h)
    {
      switch (ELF32_R_TYPE(rel->r_info))
	{
	  /* TODO: VTINHERIT/VTENTRY */
	default:
	  switch (h->root.type)
	    {
	    case bfd_link_hash_defined:
	    case bfd_link_hash_defweak:
	      return h->root.u.def.section;

	    case bfd_link_hash_common:
	      return h->root.u.c.p->section;

	    default:
	      break;
	    }
	}
    }
  else
    return bfd_section_from_elf_index(sec->owner, sym->st_shndx);

  return NULL;
}

/* Update the GOT entry reference counts for the section being removed. */
static bfd_boolean
avr32_elf_gc_sweep_hook(bfd *abfd,
			struct bfd_link_info *info ATTRIBUTE_UNUSED,
			asection *sec,
			const Elf_Internal_Rela *relocs)
{
  Elf_Internal_Shdr *symtab_hdr;
  struct elf_avr32_link_hash_entry **sym_hashes;
  struct got_entry **local_got_ents;
  const Elf_Internal_Rela *rel, *relend;

  if (!(sec->flags & SEC_ALLOC))
    return TRUE;

  symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
  sym_hashes = (struct elf_avr32_link_hash_entry **)elf_sym_hashes(abfd);
  local_got_ents = elf_local_got_ents(abfd);

  relend = relocs + sec->reloc_count;
  for (rel = relocs; rel < relend; rel++)
    {
      unsigned long r_symndx;
      unsigned int r_type;
      struct elf_avr32_link_hash_entry *h = NULL;

      r_symndx = ELF32_R_SYM(rel->r_info);
      if (r_symndx >= symtab_hdr->sh_info)
	{
	  h = sym_hashes[r_symndx - symtab_hdr->sh_info];
	  while (h->root.root.type == bfd_link_hash_indirect
		 || h->root.root.type == bfd_link_hash_warning)
	    h = (struct elf_avr32_link_hash_entry *)h->root.root.u.i.link;
	}

      r_type = ELF32_R_TYPE(rel->r_info);

      switch (r_type)
	{
	case R_AVR32_GOT32:
	case R_AVR32_GOT16:
	case R_AVR32_GOT8:
	case R_AVR32_GOT21S:
	case R_AVR32_GOT18SW:
	case R_AVR32_GOT16S:
	case R_AVR32_GOT7UW:
	case R_AVR32_LDA_GOT:
	case R_AVR32_GOTCALL:
	  if (h)
	    h->root.got.glist->refcount--;
	  else
	    local_got_ents[r_symndx]->refcount--;
	  break;

	case R_AVR32_32:
	  if (info->shared || h)
	    {
	      if (h)
		h->possibly_dynamic_relocs--;
	      else
		avr32_elf_hash_table(info)->local_dynamic_relocs--;
	    }

	default:
	  break;
	}
    }

  return TRUE;
}

/* Sizing and refcounting of dynamic sections */

static void
insert_got_entry(struct elf_avr32_link_hash_table *htab, struct got_entry *got);
static void
unref_got_entry(struct elf_avr32_link_hash_table *htab, struct got_entry *got);
static void
ref_got_entry(struct elf_avr32_link_hash_table *htab, struct got_entry *got);
static bfd_boolean
assign_got_offsets(struct elf_avr32_link_hash_table *htab);
static bfd_boolean
allocate_dynrelocs(struct elf_link_hash_entry *h, void *_info);
static bfd_boolean
avr32_elf_size_dynamic_sections (bfd *output_bfd,
				 struct bfd_link_info *info);

static void
insert_got_entry(struct elf_avr32_link_hash_table *htab, struct got_entry *got)
{
  /* Any entries with got_refcount > htab->nr_got_holes end up in the
   * last pigeonhole without any sorting. We expect the number of such
   * entries to be small, so it is very unlikely to affect
   * performance.  */
  int entry = got->refcount;

  if (entry > htab->nr_got_holes)
    entry = htab->nr_got_holes;

  got->pprev = &htab->got_hole[entry];
  got->next = htab->got_hole[entry];

  if (got->next)
    got->next->pprev = &got->next;

  htab->got_hole[entry] = got;
}

/* Decrement the refcount of a GOT entry and update its position in
   the pigeonhole array.  */
static void
unref_got_entry(struct elf_avr32_link_hash_table *htab, struct got_entry *got)
{
  BFD_ASSERT(got->refcount > 0);

  if (got->next)
    got->next->pprev = got->pprev;

  *(got->pprev) = got->next;
  got->refcount--;
  insert_got_entry(htab, got);
}

static void
ref_got_entry(struct elf_avr32_link_hash_table *htab, struct got_entry *got)
{
  if (got->next)
    got->next->pprev = got->pprev;

  *(got->pprev) = got->next;
  got->refcount++;
  insert_got_entry(htab, got);

  BFD_ASSERT(got->refcount > 0);
}

/* Assign offsets to all GOT entries we intend to keep.  The entries
   that are referenced most often are placed at low offsets so that we
   can use compact instructions as much as possible.

   Returns TRUE if any offsets or the total size of the GOT changed.  */

static bfd_boolean
assign_got_offsets(struct elf_avr32_link_hash_table *htab)
{
  struct got_entry *got;
  bfd_size_type got_size = 0;
  bfd_boolean changed = FALSE;
  bfd_signed_vma offset;
  int i;

  /* The GOT header provides the address of the DYNAMIC segment, so
     we need that even if the GOT is otherwise empty.  */
  if (htab->root.dynamic_sections_created)
    got_size = AVR32_GOT_HEADER_SIZE;

  for (i = htab->nr_got_holes; i > 0; i--)
    {
      got = htab->got_hole[i];
      while (got)
	{
	  if (got->refcount > 0)
	    {
	      offset = got_size;
	      if (got->offset != offset)
		{
		  RDBG("GOT offset changed: %ld -> %ld\n",
		       got->offset, offset);
		  changed = TRUE;
		}
	      got->offset = offset;
	      got_size += 4;
	    }
	  got = got->next;
	}
    }

  if (htab->sgot->size != got_size)
    {
      RDBG("GOT size changed: %lu -> %lu\n", htab->sgot->size,
	   got_size);
      changed = TRUE;
    }
  htab->sgot->size = got_size;

  RDBG("assign_got_offsets: total size %lu (%s)\n",
       got_size, changed ? "changed" : "no change");

  return changed;
}

static bfd_boolean
allocate_dynrelocs(struct elf_link_hash_entry *h, void *_info)
{
  struct bfd_link_info *info = _info;
  struct elf_avr32_link_hash_table *htab;
  struct elf_avr32_link_hash_entry *havr;
  struct got_entry *got;

  pr_debug("  (4b) allocate_dynrelocs: %s\n", h->root.root.string);

  if (h->root.type == bfd_link_hash_indirect)
    return TRUE;

  if (h->root.type == bfd_link_hash_warning)
    /* When warning symbols are created, they **replace** the "real"
       entry in the hash table, thus we never get to see the real
       symbol in a hash traversal.  So look at it now.  */
    h = (struct elf_link_hash_entry *) h->root.u.i.link;

  htab = avr32_elf_hash_table(info);
  havr = (struct elf_avr32_link_hash_entry *)h;

