fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
  got = h->got.glist;

  /* If got is NULL, the symbol is never referenced through the GOT */
  if (got && got->refcount > 0)
    {
      insert_got_entry(htab, got);

      /* Shared libraries need relocs for all GOT entries unless the
	 symbol is forced local or -Bsymbolic is used.  Others need
	 relocs for everything that is not guaranteed to be defined in
	 a regular object.  */
      if ((info->shared
	   && !info->symbolic
	   && h->dynindx != -1)
	  || (htab->root.dynamic_sections_created
	      && h->def_dynamic
	      && !h->def_regular))
	htab->srelgot->size += sizeof(Elf32_External_Rela);
    }

  if (havr->possibly_dynamic_relocs
      && (info->shared
	  || (elf_hash_table(info)->dynamic_sections_created
	      && h->def_dynamic
	      && !h->def_regular)))
    {
      pr_debug("Allocating %d dynamic reloc against symbol %s...\n",
	       havr->possibly_dynamic_relocs, h->root.root.string);
      htab->srelgot->size += (havr->possibly_dynamic_relocs
			      * sizeof(Elf32_External_Rela));
    }

  return TRUE;
}

/* (4) Calculate the sizes of the linker-generated sections and
   allocate memory for them.  */

static bfd_boolean
avr32_elf_size_dynamic_sections (bfd *output_bfd,
				 struct bfd_link_info *info)
{
  struct elf_avr32_link_hash_table *htab;
  bfd *dynobj;
  asection *s;
  bfd *ibfd;
  bfd_boolean relocs;

  pr_debug("(4) size dynamic sections\n");

  htab = avr32_elf_hash_table(info);
  dynobj = htab->root.dynobj;
  BFD_ASSERT(dynobj != NULL);

  if (htab->root.dynamic_sections_created)
    {
      /* Initialize the contents of the .interp section to the name of
	 the dynamic loader */
      if (info->executable)
	{
	  s = bfd_get_section_by_name(dynobj, ".interp");
	  BFD_ASSERT(s != NULL);
	  s->size = sizeof(ELF_DYNAMIC_INTERPRETER);
	  s->contents = (unsigned char *)ELF_DYNAMIC_INTERPRETER;
	}
    }

  if (htab->nr_got_holes > 0)
    {
      /* Allocate holes for the pigeonhole sort algorithm */
      pr_debug("Highest GOT refcount: %d\n", htab->nr_got_holes);

      /* Limit the memory usage by clipping the number of pigeonholes
       * at a predefined maximum. All entries with a higher refcount
       * will end up in the last pigeonhole.  */
    if (htab->nr_got_holes >= MAX_NR_GOT_HOLES)
    {
        htab->nr_got_holes = MAX_NR_GOT_HOLES - 1;

        pr_debug("Limiting maximum number of GOT pigeonholes to %u\n",
                    htab->nr_got_holes);
    }
      htab->got_hole = bfd_zalloc(output_bfd,
				  sizeof(struct got_entry *)
				  * (htab->nr_got_holes + 1));
      if (!htab->got_hole)
	return FALSE;

      /* Set up .got offsets for local syms.  */
      for (ibfd = info->input_bfds; ibfd != NULL; ibfd = ibfd->link_next)
	{
	  struct got_entry **local_got;
	  struct got_entry **end_local_got;
	  Elf_Internal_Shdr *symtab_hdr;
	  bfd_size_type locsymcount;

	  pr_debug("  (4a) processing file %s...\n", ibfd->filename);

	  BFD_ASSERT(bfd_get_flavour(ibfd) == bfd_target_elf_flavour);

	  local_got = elf_local_got_ents(ibfd);
	  if (!local_got)
	    continue;

	  symtab_hdr = &elf_tdata(ibfd)->symtab_hdr;
	  locsymcount = symtab_hdr->sh_info;
	  end_local_got = local_got + locsymcount;

	  for (; local_got < end_local_got; ++local_got)
	    insert_got_entry(htab, *local_got);
	}
    }

  /* Allocate global sym .got entries and space for global sym
     dynamic relocs */
  elf_link_hash_traverse(&htab->root, allocate_dynrelocs, info);

  /* Now that we have sorted the GOT entries, we are ready to
     assign offsets and determine the initial size of the GOT. */
  if (htab->sgot)
    assign_got_offsets(htab);

  /* Allocate space for local sym dynamic relocs */
  BFD_ASSERT(htab->local_dynamic_relocs == 0 || info->shared);
  if (htab->local_dynamic_relocs)
    htab->srelgot->size += (htab->local_dynamic_relocs
			    * sizeof(Elf32_External_Rela));

  /* We now have determined the sizes of the various dynamic
     sections. Allocate memory for them. */
  relocs = FALSE;
  for (s = dynobj->sections; s; s = s->next)
    {
      if ((s->flags & SEC_LINKER_CREATED) == 0)
	continue;

      if (s == htab->sgot
	  || s == htab->sstub)
	{
	  /* Strip this section if we don't need it */
	}
      else if (strncmp (bfd_get_section_name(dynobj, s), ".rela", 5) == 0)
	{
	  if (s->size != 0)
	    relocs = TRUE;

	  s->reloc_count = 0;
	}
      else
	{
	  /* It's not one of our sections */
	  continue;
	}

      if (s->size == 0)
	{
	  /* Strip unneeded sections */
	  pr_debug("Stripping section %s from output...\n", s->name);
	  /* deleted function in 2.17
      _bfd_strip_section_from_output(info, s);
      */
	  continue;
	}

      s->contents = bfd_zalloc(dynobj, s->size);
      if (s->contents == NULL)
	return FALSE;
    }

  if (htab->root.dynamic_sections_created)
    {
      /* Add some entries to the .dynamic section.  We fill in the
	 values later, in sh_elf_finish_dynamic_sections, but we
	 must add the entries now so that we get the correct size for
	 the .dynamic section.  The DT_DEBUG entry is filled in by the
	 dynamic linker and used by the debugger.  */
#define add_dynamic_entry(TAG, VAL) _bfd_elf_add_dynamic_entry(info, TAG, VAL)

      if (!add_dynamic_entry(DT_PLTGOT, 0))
	return FALSE;
      if (!add_dynamic_entry(DT_AVR32_GOTSZ, 0))
	return FALSE;

      if (info->executable)
	{
	  if (!add_dynamic_entry(DT_DEBUG, 0))
	    return FALSE;
	}
      if (relocs)
	{
	  if (!add_dynamic_entry(DT_RELA, 0)
	      || !add_dynamic_entry(DT_RELASZ, 0)
	      || !add_dynamic_entry(DT_RELAENT,
				    sizeof(Elf32_External_Rela)))
	    return FALSE;
	}
    }
#undef add_dynamic_entry

  return TRUE;
}


/* Access to internal relocations, section contents and symbols.
   (stolen from the xtensa port)  */

static Elf_Internal_Rela *
retrieve_internal_relocs (bfd *abfd, asection *sec, bfd_boolean keep_memory);
static void
pin_internal_relocs (asection *sec, Elf_Internal_Rela *internal_relocs);
static void
release_internal_relocs (asection *sec, Elf_Internal_Rela *internal_relocs);
static bfd_byte *
retrieve_contents (bfd *abfd, asection *sec, bfd_boolean keep_memory);
/*
static void
pin_contents (asection *sec, bfd_byte *contents);
*/
static void
release_contents (asection *sec, bfd_byte *contents);
static Elf_Internal_Sym *
retrieve_local_syms (bfd *input_bfd, bfd_boolean keep_memory);
/*
static void
pin_local_syms (bfd *input_bfd, Elf_Internal_Sym *isymbuf);
*/
static void
release_local_syms (bfd *input_bfd, Elf_Internal_Sym *isymbuf);

