fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
/* During relaxation, we need to modify relocations, section contents,
   and symbol definitions, and we need to keep the original values from
   being reloaded from the input files, i.e., we need to "pin" the
   modified values in memory.  We also want to continue to observe the
   setting of the "keep-memory" flag.  The following functions wrap the
   standard BFD functions to take care of this for us.  */

static Elf_Internal_Rela *
retrieve_internal_relocs (bfd *abfd, asection *sec, bfd_boolean keep_memory)
{
  /* _bfd_elf_link_read_relocs knows about caching, so no need for us
     to be clever here.  */
  return _bfd_elf_link_read_relocs(abfd, sec, NULL, NULL, keep_memory);
}

static void
pin_internal_relocs (asection *sec, Elf_Internal_Rela *internal_relocs)
{
  elf_section_data (sec)->relocs = internal_relocs;
}

static void
release_internal_relocs (asection *sec, Elf_Internal_Rela *internal_relocs)
{
  if (internal_relocs
      && elf_section_data (sec)->relocs != internal_relocs)
    free (internal_relocs);
}

static bfd_byte *
retrieve_contents (bfd *abfd, asection *sec, bfd_boolean keep_memory)
{
  bfd_byte *contents;
  bfd_size_type sec_size;

  sec_size = bfd_get_section_limit (abfd, sec);
  contents = elf_section_data (sec)->this_hdr.contents;

  if (contents == NULL && sec_size != 0)
    {
      if (!bfd_malloc_and_get_section (abfd, sec, &contents))
	{
	  if (contents)
	    free (contents);
	  return NULL;
	}
      if (keep_memory)
	elf_section_data (sec)->this_hdr.contents = contents;
    }
  return contents;
}

/*
static void
pin_contents (asection *sec, bfd_byte *contents)
{
  elf_section_data (sec)->this_hdr.contents = contents;
}
*/
static void
release_contents (asection *sec, bfd_byte *contents)
{
  if (contents && elf_section_data (sec)->this_hdr.contents != contents)
    free (contents);
}

static Elf_Internal_Sym *
retrieve_local_syms (bfd *input_bfd, bfd_boolean keep_memory)
{
  Elf_Internal_Shdr *symtab_hdr;
  Elf_Internal_Sym *isymbuf;
  size_t locsymcount;

  symtab_hdr = &elf_tdata (input_bfd)->symtab_hdr;
  locsymcount = symtab_hdr->sh_info;

  isymbuf = (Elf_Internal_Sym *) symtab_hdr->contents;
  if (isymbuf == NULL && locsymcount != 0)
    {
      isymbuf = bfd_elf_get_elf_syms (input_bfd, symtab_hdr, locsymcount, 0,
				      NULL, NULL, NULL);
      if (isymbuf && keep_memory)
	symtab_hdr->contents = (unsigned char *) isymbuf;
    }

  return isymbuf;
}

/*
static void
pin_local_syms (bfd *input_bfd, Elf_Internal_Sym *isymbuf)
{
  elf_tdata (input_bfd)->symtab_hdr.contents = (unsigned char *)isymbuf;
}

*/
static void
release_local_syms (bfd *input_bfd, Elf_Internal_Sym *isymbuf)
{
  if (isymbuf && (elf_tdata (input_bfd)->symtab_hdr.contents
		  != (unsigned char *)isymbuf))
    free (isymbuf);
}

/* Data structures used during relaxation. */

enum relax_state_id {
  RS_ERROR = -1,
  RS_NONE = 0,
  RS_ALIGN,
  RS_CPENT,
  RS_PIC_CALL,
  RS_PIC_MCALL,
  RS_PIC_RCALL2,
  RS_PIC_RCALL1,
  RS_PIC_LDA,
  RS_PIC_LDW4,
  RS_PIC_LDW3,
  RS_PIC_SUB5,
  RS_NOPIC_MCALL,
  RS_NOPIC_RCALL2,
  RS_NOPIC_RCALL1,
  RS_NOPIC_LDW4,
  RS_NOPIC_LDDPC,
  RS_NOPIC_SUB5,
  RS_NOPIC_MOV2,
  RS_NOPIC_MOV1,
  RS_RCALL2,
  RS_RCALL1,
  RS_BRC2,
  RS_BRC1,
  RS_BRAL,
  RS_RJMP,
  RS_MAX,
};

enum reference_type {
  REF_ABSOLUTE,
  REF_PCREL,
  REF_CPOOL,
  REF_GOT,
};

struct relax_state
{
  const char *name;
  enum relax_state_id id;
  enum relax_state_id direct;
  enum relax_state_id next;
  enum relax_state_id prev;

  enum reference_type reftype;

  unsigned int r_type;

  bfd_vma opcode;
  bfd_vma opcode_mask;

  bfd_signed_vma range_min;
  bfd_signed_vma range_max;

  bfd_size_type size;
};

/*
 * This is for relocs that
 *   a) has an addend or is of type R_AVR32_DIFF32, and
 *   b) references a different section than it's in, and
 *   c) references a section that is relaxable
 *
 * as well as relocs that references the constant pool, in which case
 * the add_frag member points to the frag containing the constant pool
 * entry.
 *
 * Such relocs must be fixed up whenever we delete any code. Sections
 * that don't have any relocs with all of the above properties don't
 * have any additional reloc data, but sections that do will have
 * additional data for all its relocs.
 */
struct avr32_reloc_data
{
  struct fragment *add_frag;
  struct fragment *sub_frag;
};

/*
 * A 'fragment' is a relaxable entity, that is, code may be added or
 * deleted at the end of a fragment. When this happens, all subsequent
 * fragments in the list will have their offsets updated.
 */
struct fragment
{
  enum relax_state_id state;
  enum relax_state_id initial_state;

  Elf_Internal_Rela *rela;
  bfd_size_type size;
  bfd_vma offset;
  int size_adjust;
  int offset_adjust;
  bfd_boolean has_grown;

  /* Only used by constant pool entries.  When this drops to zero, the
     frag is discarded (i.e. size_adjust is set to -4.)  */
  int refcount;
};

struct avr32_relax_data
{
  unsigned int frag_count;
  struct fragment *frag;
  struct avr32_reloc_data *reloc_data;

  /* TRUE if this section has one or more relaxable relocations */
  bfd_boolean is_relaxable;
  unsigned int iteration;
};

struct avr32_section_data
{
  struct bfd_elf_section_data elf;
  struct avr32_relax_data relax_data;
};

/* Relax state definitions */

#define PIC_MOV2_OPCODE		0xe0600000
#define PIC_MOV2_MASK		0xe1e00000
#define PIC_MOV2_RANGE_MIN	(-1048576 * 4)
#define PIC_MOV2_RANGE_MAX	(1048575 * 4)
#define PIC_MCALL_OPCODE	0xf0160000
#define PIC_MCALL_MASK		0xffff0000
#define PIC_MCALL_RANGE_MIN	(-131072)
#define PIC_MCALL_RANGE_MAX	(131068)
#define RCALL2_OPCODE		0xe0a00000
#define RCALL2_MASK		0xe1ef0000
#define RCALL2_RANGE_MIN	(-2097152)
#define RCALL2_RANGE_MAX	(2097150)
#define RCALL1_OPCODE		0xc00c0000
#define RCALL1_MASK		0xf00c0000
#define RCALL1_RANGE_MIN	(-1024)
#define RCALL1_RANGE_MAX	(1022)
#define PIC_LDW4_OPCODE		0xecf00000
#define PIC_LDW4_MASK		0xfff00000
#define PIC_LDW4_RANGE_MIN	(-32768)
#define PIC_LDW4_RANGE_MAX	(32767)
#define PIC_LDW3_OPCODE		0x6c000000
#define PIC_LDW3_MASK		0xfe000000
#define PIC_LDW3_RANGE_MIN	(0)
#define PIC_LDW3_RANGE_MAX	(124)
#define SUB5_PC_OPCODE		0xfec00000
#define SUB5_PC_MASK		0xfff00000
#define SUB5_PC_RANGE_MIN	(-32768)
#define SUB5_PC_RANGE_MAX	(32767)
#define NOPIC_MCALL_OPCODE	0xf01f0000
#define NOPIC_MCALL_MASK	0xffff0000
#define NOPIC_MCALL_RANGE_MIN	PIC_MCALL_RANGE_MIN
#define NOPIC_MCALL_RANGE_MAX	PIC_MCALL_RANGE_MAX
#define NOPIC_LDW4_OPCODE	0xfef00000
#define NOPIC_LDW4_MASK		0xfff00000
#define NOPIC_LDW4_RANGE_MIN	PIC_LDW4_RANGE_MIN
#define NOPIC_LDW4_RANGE_MAX	PIC_LDW4_RANGE_MAX
#define LDDPC_OPCODE		0x48000000
#define LDDPC_MASK		0xf8000000
#define LDDPC_RANGE_MIN		0
#define LDDPC_RANGE_MAX		508

