fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
#define NOPIC_MOV2_OPCODE  0xe0600000
#define NOPIC_MOV2_MASK        0xe1e00000
#define NOPIC_MOV2_RANGE_MIN   (-1048576)
#define NOPIC_MOV2_RANGE_MAX   (1048575)
#define NOPIC_MOV1_OPCODE  0x30000000
#define NOPIC_MOV1_MASK        0xf0000000
#define NOPIC_MOV1_RANGE_MIN   (-128)
#define NOPIC_MOV1_RANGE_MAX   (127)

/* Only brc2 variants with cond[3] == 0 is considered, since the
   others are not relaxable.  bral is a special case and is handled
   separately.  */
#define BRC2_OPCODE		0xe0800000
#define BRC2_MASK		0xe1e80000
#define BRC2_RANGE_MIN		(-2097152)
#define BRC2_RANGE_MAX		(2097150)
#define BRC1_OPCODE		0xc0000000
#define BRC1_MASK		0xf0080000
#define BRC1_RANGE_MIN		(-256)
#define BRC1_RANGE_MAX		(254)
#define BRAL_OPCODE		0xe08f0000
#define BRAL_MASK		0xe1ef0000
#define BRAL_RANGE_MIN		BRC2_RANGE_MIN
#define BRAL_RANGE_MAX		BRC2_RANGE_MAX
#define RJMP_OPCODE		0xc0080000
#define RJMP_MASK		0xf00c0000
#define RJMP_RANGE_MIN		(-1024)
#define RJMP_RANGE_MAX		(1022)

/* Define a relax state using the GOT  */
#define RG(id, dir, next, prev, r_type, opc, size)			\
  { "RS_"#id, RS_##id, RS_##dir, RS_##next, RS_##prev, REF_GOT,		\
      R_AVR32_##r_type,	opc##_OPCODE, opc##_MASK,			\
      opc##_RANGE_MIN, opc##_RANGE_MAX, size }
/* Define a relax state using the Constant Pool  */
#define RC(id, dir, next, prev, r_type, opc, size)			\
  { "RS_"#id, RS_##id, RS_##dir, RS_##next, RS_##prev, REF_CPOOL,	\
      R_AVR32_##r_type,	opc##_OPCODE, opc##_MASK,			\
      opc##_RANGE_MIN, opc##_RANGE_MAX, size }

/* Define a relax state using pc-relative direct reference  */
#define RP(id, dir, next, prev, r_type, opc, size)			\
  { "RS_"#id, RS_##id, RS_##dir, RS_##next, RS_##prev, REF_PCREL,	\
      R_AVR32_##r_type,	opc##_OPCODE, opc##_MASK,			\
      opc##_RANGE_MIN, opc##_RANGE_MAX, size }

/* Define a relax state using non-pc-relative direct reference */
#define RD(id, dir, next, prev, r_type, opc, size)         \
  { "RS_"#id, RS_##id, RS_##dir, RS_##next, RS_##prev, REF_ABSOLUTE,   \
      R_AVR32_##r_type,    opc##_OPCODE, opc##_MASK,           \
      opc##_RANGE_MIN, opc##_RANGE_MAX, size }

/* Define a relax state that will be handled specially  */
#define RS(id, r_type, size)						\
  { "RS_"#id, RS_##id, RS_NONE, RS_NONE, RS_NONE, REF_ABSOLUTE,		\
      R_AVR32_##r_type, 0, 0, 0, 0, size }

const struct relax_state relax_state[RS_MAX] = {
  RS(NONE, NONE, 0),
  RS(ALIGN, ALIGN, 0),
  RS(CPENT, 32_CPENT, 4),

  RG(PIC_CALL, PIC_RCALL1, PIC_MCALL, NONE, GOTCALL, PIC_MOV2, 10),
  RG(PIC_MCALL, PIC_RCALL1, NONE, PIC_CALL, GOT18SW, PIC_MCALL, 4),
  RP(PIC_RCALL2, NONE, PIC_RCALL1, PIC_MCALL, 22H_PCREL, RCALL2, 4),
  RP(PIC_RCALL1, NONE, NONE, PIC_RCALL2, 11H_PCREL, RCALL1, 2),

  RG(PIC_LDA, PIC_SUB5, PIC_LDW4, NONE, LDA_GOT, PIC_MOV2, 8),
  RG(PIC_LDW4, PIC_SUB5, PIC_LDW3, PIC_LDA, GOT16S, PIC_LDW4, 4),
  RG(PIC_LDW3, PIC_SUB5, NONE, PIC_LDW4, GOT7UW, PIC_LDW3, 2),
  RP(PIC_SUB5, NONE, NONE, PIC_LDW3, 16N_PCREL, SUB5_PC, 4),

  RC(NOPIC_MCALL, NOPIC_RCALL1, NONE, NONE, CPCALL, NOPIC_MCALL, 4),
  RP(NOPIC_RCALL2, NONE, NOPIC_RCALL1, NOPIC_MCALL, 22H_PCREL, RCALL2, 4),
  RP(NOPIC_RCALL1, NONE, NONE, NOPIC_RCALL2, 11H_PCREL, RCALL1, 2),

  RC(NOPIC_LDW4, NOPIC_MOV1, NOPIC_LDDPC, NONE, 16_CP, NOPIC_LDW4, 4),
  RC(NOPIC_LDDPC, NOPIC_MOV1, NONE, NOPIC_LDW4, 9W_CP, LDDPC, 2),
  RP(NOPIC_SUB5, NOPIC_MOV1, NONE, NOPIC_LDDPC, 16N_PCREL, SUB5_PC, 4),
  RD(NOPIC_MOV2, NONE, NOPIC_MOV1, NOPIC_SUB5, 21S, NOPIC_MOV2, 4),
  RD(NOPIC_MOV1, NONE, NONE, NOPIC_MOV2, 8S, NOPIC_MOV1, 2),

  RP(RCALL2, NONE, RCALL1, NONE, 22H_PCREL, RCALL2, 4),
  RP(RCALL1, NONE, NONE, RCALL2, 11H_PCREL, RCALL1, 2),
  RP(BRC2, NONE, BRC1, NONE, 22H_PCREL, BRC2, 4),
  RP(BRC1, NONE, NONE, BRC2, 9H_PCREL, BRC1, 2),
  RP(BRAL, NONE, RJMP, NONE, 22H_PCREL, BRAL, 4),
  RP(RJMP, NONE, NONE, BRAL, 11H_PCREL, RJMP, 2),
};

static bfd_boolean
avr32_elf_new_section_hook(bfd *abfd, asection *sec)
{
  struct avr32_section_data *sdata;

  sdata = bfd_zalloc(abfd, sizeof(struct avr32_section_data));
  if (!sdata)
    return FALSE;

  sec->used_by_bfd = sdata;
  return _bfd_elf_new_section_hook(abfd, sec);
}

static struct avr32_relax_data *
avr32_relax_data(asection *sec)
{
  struct avr32_section_data *sdata;

  BFD_ASSERT(sec->used_by_bfd);

  sdata = (struct avr32_section_data *)elf_section_data(sec);
  return &sdata->relax_data;
}

/* Link-time relaxation */

static bfd_boolean
avr32_elf_relax_section(bfd *abfd, asection *sec,
			struct bfd_link_info *info, bfd_boolean *again);

enum relax_pass_id {
  RELAX_PASS_SIZE_FRAGS,
  RELAX_PASS_MOVE_DATA,
};

/* Stolen from the xtensa port */
static int
internal_reloc_compare (const void *ap, const void *bp)
{
  const Elf_Internal_Rela *a = (const Elf_Internal_Rela *) ap;
  const Elf_Internal_Rela *b = (const Elf_Internal_Rela *) bp;

  if (a->r_offset != b->r_offset)
    return (a->r_offset - b->r_offset);

  /* We don't need to sort on these criteria for correctness,
     but enforcing a more strict ordering prevents unstable qsort
     from behaving differently with different implementations.
     Without the code below we get correct but different results
     on Solaris 2.7 and 2.8.  We would like to always produce the
     same results no matter the host.  */

  if (a->r_info != b->r_info)
    return (a->r_info - b->r_info);

  return (a->r_addend - b->r_addend);
}

static enum relax_state_id
get_pcrel22_relax_state(bfd *abfd, asection *sec, struct bfd_link_info *info,
			const Elf_Internal_Rela *rela)
{
  bfd_byte *contents;
  bfd_vma insn;
  enum relax_state_id rs = RS_NONE;

  contents = retrieve_contents(abfd, sec, info->keep_memory);
  if (!contents)
    return RS_ERROR;

  insn = bfd_get_32(abfd, contents + rela->r_offset);
  if ((insn & RCALL2_MASK) == RCALL2_OPCODE)
    rs = RS_RCALL2;
  else if ((insn & BRAL_MASK) == BRAL_OPCODE)
    /* Optimizing bral -> rjmp gets us into all kinds of
       trouble with jump tables. Better not do it.  */
    rs = RS_NONE;
  else if ((insn & BRC2_MASK) == BRC2_OPCODE)
    rs = RS_BRC2;

  release_contents(sec, contents);

  return rs;
}

static enum relax_state_id
get_initial_relax_state(bfd *abfd, asection *sec, struct bfd_link_info *info,
			const Elf_Internal_Rela *rela)
{
  switch (ELF_R_TYPE(rela->r_info))
    {
    case R_AVR32_GOTCALL:
      return RS_PIC_CALL;
    case R_AVR32_GOT18SW:
      return RS_PIC_MCALL;
    case R_AVR32_LDA_GOT:
      return RS_PIC_LDA;
    case R_AVR32_GOT16S:
      return RS_PIC_LDW4;
    case R_AVR32_CPCALL:
      return RS_NOPIC_MCALL;
    case R_AVR32_16_CP:
      return RS_NOPIC_LDW4;
    case R_AVR32_9W_CP:
      return RS_NOPIC_LDDPC;
    case R_AVR32_ALIGN:
      return RS_ALIGN;
    case R_AVR32_32_CPENT:
      return RS_CPENT;
    case R_AVR32_22H_PCREL:
      return get_pcrel22_relax_state(abfd, sec, info, rela);
    case R_AVR32_9H_PCREL:
      return RS_BRC1;
    default:
      return RS_NONE;
    }
}

static bfd_boolean
reloc_is_cpool_ref(const Elf_Internal_Rela *rela)
{
  switch (ELF_R_TYPE(rela->r_info))
    {
    case R_AVR32_CPCALL:
    case R_AVR32_16_CP:
    case R_AVR32_9W_CP:
      return TRUE;
    default:
      return FALSE;
    }
}

