fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
static struct fragment *
new_frag(bfd *abfd ATTRIBUTE_UNUSED, asection *sec,
	 struct avr32_relax_data *rd, enum relax_state_id state,
	 Elf_Internal_Rela *rela)
{
  struct fragment *frag;
  bfd_size_type r_size;
  bfd_vma r_offset;
  unsigned int i = rd->frag_count;

  BFD_ASSERT(state >= RS_NONE && state < RS_MAX);

  rd->frag_count++;
  frag = bfd_realloc(rd->frag, sizeof(struct fragment) * rd->frag_count);
  if (!frag)
    return NULL;
  rd->frag = frag;

  frag += i;
  memset(frag, 0, sizeof(struct fragment));

  if (state == RS_ALIGN)
    r_size = (((rela->r_offset + (1 << rela->r_addend) - 1)
	       & ~((1 << rela->r_addend) - 1)) - rela->r_offset);
  else
    r_size = relax_state[state].size;

  if (rela)
    r_offset = rela->r_offset;
  else
    r_offset = sec->size;

  if (i == 0)
    {
      frag->offset = 0;
      frag->size = r_offset + r_size;
    }
  else
    {
      frag->offset = rd->frag[i - 1].offset + rd->frag[i - 1].size;
      frag->size = r_offset + r_size - frag->offset;
    }

  if (state != RS_CPENT)
    /* Make sure we don't discard this frag */
    frag->refcount = 1;

  frag->initial_state = frag->state = state;
  frag->rela = rela;

  return frag;
}

static struct fragment *
find_frag(asection *sec, bfd_vma offset)
{
  struct fragment *first, *last;
  struct avr32_relax_data *rd = avr32_relax_data(sec);

  if (rd->frag_count == 0)
    return NULL;

  first = &rd->frag[0];
  last = &rd->frag[rd->frag_count - 1];

  /* This may be a reloc referencing the end of a section.  The last
     frag will never have a reloc associated with it, so its size will
     never change, thus the offset adjustment of the last frag will
     always be the same as the offset adjustment of the end of the
     section.  */
  if (offset == sec->size)
    {
      BFD_ASSERT(last->offset + last->size == sec->size);
      BFD_ASSERT(!last->rela);
      return last;
    }

  while (first <= last)
    {
      struct fragment *mid;

      mid = (last - first) / 2 + first;
      if ((mid->offset + mid->size) <= offset)
	first = mid + 1;
      else if (mid->offset > offset)
	last = mid - 1;
      else
	return mid;
    }

  return NULL;
}

/* Look through all relocs in a section and determine if any relocs
   may be affected by relaxation in other sections.  If so, allocate
   an array of additional relocation data which links the affected
   relocations to the frag(s) where the relaxation may occur.

   This function also links cpool references to cpool entries and
   increments the refcount of the latter when this happens.  */

static bfd_boolean
allocate_reloc_data(bfd *abfd, asection *sec, Elf_Internal_Rela *relocs,
		    struct bfd_link_info *info)
{
  Elf_Internal_Shdr *symtab_hdr;
  Elf_Internal_Sym *isymbuf = NULL;
  struct avr32_relax_data *rd;
  unsigned int i;
  bfd_boolean ret = FALSE;

  symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
  rd = avr32_relax_data(sec);

  RDBG("%s<%s>: allocate_reloc_data\n", abfd->filename, sec->name);

  for (i = 0; i < sec->reloc_count; i++)
    {
      Elf_Internal_Rela *rel = &relocs[i];
      asection *sym_sec;
      unsigned long r_symndx;
      bfd_vma sym_value;

      if (!rel->r_addend && ELF_R_TYPE(rel->r_info) != R_AVR32_DIFF32
	  && !reloc_is_cpool_ref(rel))
	continue;

      r_symndx = ELF_R_SYM(rel->r_info);

      if (r_symndx < symtab_hdr->sh_info)
	{
	  Elf_Internal_Sym *isym;

	  if (!isymbuf)
	    isymbuf = retrieve_local_syms(abfd, info->keep_memory);
	  if (!isymbuf)
	    return FALSE;

	  isym = &isymbuf[r_symndx];
	  sym_sec = bfd_section_from_elf_index(abfd, isym->st_shndx);
	  sym_value = isym->st_value;
	}
      else
	{
	  struct elf_link_hash_entry *h;

	  h = elf_sym_hashes(abfd)[r_symndx - symtab_hdr->sh_info];

	  while (h->root.type == bfd_link_hash_indirect
		 || h->root.type == bfd_link_hash_warning)
	    h = (struct elf_link_hash_entry *)h->root.u.i.link;

	  if (h->root.type != bfd_link_hash_defined
	      && h->root.type != bfd_link_hash_defweak)
	    continue;

	  sym_sec = h->root.u.def.section;
	  sym_value = h->root.u.def.value;
	}

      if (sym_sec && avr32_relax_data(sym_sec)->is_relaxable)
	{
	  bfd_size_type size;
	  struct fragment *frag;

	  if (!rd->reloc_data)
	    {
	      size = sizeof(struct avr32_reloc_data) * sec->reloc_count;
	      rd->reloc_data = bfd_zalloc(abfd, size);
	      if (!rd->reloc_data)
		goto out;
	    }

	  RDBG("[%3d] 0x%04lx: target: 0x%lx + 0x%lx",
	       i, rel->r_offset, sym_value, rel->r_addend);

	  frag = find_frag(sym_sec, sym_value + rel->r_addend);
	  BFD_ASSERT(frag);
	  rd->reloc_data[i].add_frag = frag;

	  RDBG(" -> %s<%s>:%04lx\n", sym_sec->owner->filename, sym_sec->name,
	       frag->rela ? frag->rela->r_offset : sym_sec->size);

	  if (reloc_is_cpool_ref(rel))
	    {
	      BFD_ASSERT(ELF_R_TYPE(frag->rela->r_info) == R_AVR32_32_CPENT);
	      frag->refcount++;
	    }

	  if (ELF_R_TYPE(rel->r_info) == R_AVR32_DIFF32)
	    {
	      bfd_byte *contents;
	      bfd_signed_vma diff;

	      contents = retrieve_contents(abfd, sec, info->keep_memory);
	      if (!contents)
		goto out;

	      diff = bfd_get_signed_32(abfd, contents + rel->r_offset);
	      frag = find_frag(sym_sec, sym_value + rel->r_addend + diff);
	      BFD_ASSERT(frag);
	      rd->reloc_data[i].sub_frag = frag;

	      release_contents(sec, contents);
	    }
	}
    }

  ret = TRUE;

 out:
  release_local_syms(abfd, isymbuf);
  return ret;
}

static bfd_boolean
global_sym_set_frag(struct elf_avr32_link_hash_entry *havr,
		    struct bfd_link_info *info ATTRIBUTE_UNUSED)
{
  struct fragment *frag;
  asection *sec;

  if (havr->root.root.type != bfd_link_hash_defined
      && havr->root.root.type != bfd_link_hash_defweak)
    return TRUE;

  sec = havr->root.root.u.def.section;
  if (bfd_is_const_section(sec)
      || !avr32_relax_data(sec)->is_relaxable)
    return TRUE;

  frag = find_frag(sec, havr->root.root.u.def.value);
  if (!frag)
    {
      unsigned int i;
      struct avr32_relax_data *rd = avr32_relax_data(sec);

      RDBG("In %s: No frag for %s <%s+%lu> (limit %lu)\n",
	   sec->owner->filename, havr->root.root.root.string,
	   sec->name, havr->root.root.u.def.value, sec->size);
      for (i = 0; i < rd->frag_count; i++)
	RDBG("    %8lu - %8lu\n", rd->frag[i].offset,
	     rd->frag[i].offset + rd->frag[i].size);
    }
  BFD_ASSERT(frag);

  havr->sym_frag = frag;
  return TRUE;
}

static bfd_boolean
analyze_relocations(struct bfd_link_info *info)
{
  bfd *abfd;
  asection *sec;

  /* Divide all relaxable sections into fragments */
  for (abfd = info->input_bfds; abfd; abfd = abfd->link_next)
    {
      if (!(elf_elfheader(abfd)->e_flags & EF_AVR32_LINKRELAX))
	{
	  if (!(*info->callbacks->warning)
	      (info, _("input is not relaxable"), NULL, abfd, NULL, 0))
	    return FALSE;
	  continue;
	}

