fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
      for (sec = abfd->sections; sec; sec = sec->next)
	{
	  struct avr32_relax_data *rd;
	  struct fragment *frag;
	  Elf_Internal_Rela *relocs;
	  unsigned int i;
	  bfd_boolean ret = TRUE;

	  if (!(sec->flags & SEC_RELOC) || sec->reloc_count == 0)
	    continue;

	  rd = avr32_relax_data(sec);

	  relocs = retrieve_internal_relocs(abfd, sec, info->keep_memory);
	  if (!relocs)
	    return FALSE;

	  qsort(relocs, sec->reloc_count, sizeof(Elf_Internal_Rela),
		internal_reloc_compare);

	  for (i = 0; i < sec->reloc_count; i++)
	    {
	      enum relax_state_id state;

	      ret = FALSE;
	      state = get_initial_relax_state(abfd, sec, info, &relocs[i]);
	      if (state == RS_ERROR)
		break;

	      if (state)
		{
		  frag = new_frag(abfd, sec, rd, state, &relocs[i]);
		  if (!frag)
		    break;

		  pin_internal_relocs(sec, relocs);
		  rd->is_relaxable = TRUE;
		}

	      ret = TRUE;
	    }

	  release_internal_relocs(sec, relocs);
	  if (!ret)
	    return ret;

	  if (rd->is_relaxable)
	    {
	      frag = new_frag(abfd, sec, rd, RS_NONE, NULL);
	      if (!frag)
		return FALSE;
	    }
	}
    }

  /* Link each global symbol to the fragment where it's defined.  */
  elf_link_hash_traverse(elf_hash_table(info), global_sym_set_frag, info);

  /* Do the same for local symbols. */
  for (abfd = info->input_bfds; abfd; abfd = abfd->link_next)
    {
      Elf_Internal_Sym *isymbuf, *isym;
      struct fragment **local_sym_frag;
      unsigned int i, sym_count;

      sym_count = elf_tdata(abfd)->symtab_hdr.sh_info;
      if (sym_count == 0)
	continue;

      local_sym_frag = bfd_zalloc(abfd, sym_count * sizeof(struct fragment *));
      if (!local_sym_frag)
	return FALSE;
      elf_tdata(abfd)->local_sym_frag = local_sym_frag;

      isymbuf = retrieve_local_syms(abfd, info->keep_memory);
      if (!isymbuf)
	return FALSE;

      for (i = 0; i < sym_count; i++)
	{
	  struct avr32_relax_data *rd;
	  struct fragment *frag;
	  asection *sec;

	  isym = &isymbuf[i];

	  sec = bfd_section_from_elf_index(abfd, isym->st_shndx);
	  if (!sec)
	    continue;

	  rd = avr32_relax_data(sec);
	  if (!rd->is_relaxable)
	    continue;

	  frag = find_frag(sec, isym->st_value);
	  BFD_ASSERT(frag);

	  local_sym_frag[i] = frag;
	}

      release_local_syms(abfd, isymbuf);
    }

  /* And again for relocs with addends and constant pool references */
  for (abfd = info->input_bfds; abfd; abfd = abfd->link_next)
    for (sec = abfd->sections; sec; sec = sec->next)
      {
	Elf_Internal_Rela *relocs;
	bfd_boolean ret;

	if (!(sec->flags & SEC_RELOC) || sec->reloc_count == 0)
	  continue;

	relocs = retrieve_internal_relocs(abfd, sec, info->keep_memory);
	if (!relocs)
	  return FALSE;

	ret = allocate_reloc_data(abfd, sec, relocs, info);

	release_internal_relocs(sec, relocs);
	if (ret == FALSE)
	  return ret;
      }

  return TRUE;
}

static bfd_boolean
rs_is_good_enough(const struct relax_state *rs, struct fragment *frag,
		  bfd_vma symval, bfd_vma addr, struct got_entry *got,
		  struct avr32_reloc_data *ind_data,
		  bfd_signed_vma offset_adjust)
{
  bfd_signed_vma target = 0;

  switch (rs->reftype)
    {
    case REF_ABSOLUTE:
      target = symval;
      break;
    case REF_PCREL:
      target = symval - addr;
      break;
    case REF_CPOOL:
      /* cpool frags are always in the same section and always after
	 all frags referring to it.  So it's always correct to add in
	 offset_adjust here.  */
      target = (ind_data->add_frag->offset + ind_data->add_frag->offset_adjust
		+ offset_adjust - frag->offset - frag->offset_adjust);
      break;
    case REF_GOT:
      target = got->offset;
      break;
    default:
      abort();
    }

  if (target >= rs->range_min && target <= rs->range_max)
    return TRUE;
  else
    return FALSE;
}

static bfd_boolean
avr32_size_frags(bfd *abfd, asection *sec, struct bfd_link_info *info)
{
  struct elf_avr32_link_hash_table *htab;
  struct avr32_relax_data *rd;
  Elf_Internal_Shdr *symtab_hdr;
  Elf_Internal_Rela *relocs = NULL;
  Elf_Internal_Sym *isymbuf = NULL;
  struct got_entry **local_got_ents;
  struct fragment **local_sym_frag;
  bfd_boolean ret = FALSE;
  bfd_signed_vma delta = 0;
  unsigned int i;

  htab = avr32_elf_hash_table(info);
  rd = avr32_relax_data(sec);

  if (sec == htab->sgot)
    {
      RDBG("Relaxing GOT section (vma: 0x%lx)\n",
	   sec->output_section->vma + sec->output_offset);
      if (assign_got_offsets(htab))
	htab->repeat_pass = TRUE;
      return TRUE;
    }

  if (!rd->is_relaxable)
    return TRUE;

  if (!sec->rawsize)
    sec->rawsize = sec->size;

  symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
  relocs = retrieve_internal_relocs(abfd, sec, info->keep_memory);
  if (!relocs)
    goto out;

  isymbuf = retrieve_local_syms(abfd, info->keep_memory);
  if (!isymbuf)
    goto out;

  local_got_ents = elf_local_got_ents(abfd);
  local_sym_frag = elf_tdata(abfd)->local_sym_frag;

  RDBG("size_frags: %s<%s>\n  vma: 0x%08lx, size: 0x%08lx\n",
       abfd->filename, sec->name,
       sec->output_section->vma + sec->output_offset, sec->size);

  for (i = 0; i < rd->frag_count; i++)
    {
      struct fragment *frag = &rd->frag[i];
      struct avr32_reloc_data *r_data = NULL, *ind_data = NULL;
      const struct relax_state *state, *next_state;
      struct fragment *target_frag = NULL;
      asection *sym_sec = NULL;
      Elf_Internal_Rela *rela;
      struct got_entry *got;
      bfd_vma symval, r_offset, addend, addr;
      bfd_signed_vma size_adjust = 0, distance;
      unsigned long r_symndx;
      bfd_boolean defined = TRUE, dynamic = FALSE;
      unsigned char sym_type;

      frag->offset_adjust += delta;
      state = next_state = &relax_state[frag->state];
      rela = frag->rela;

      BFD_ASSERT(state->id == frag->state);

      RDBG("  0x%04lx%c%d: %s [size %ld]", rela ? rela->r_offset : sec->rawsize,
	   (frag->offset_adjust < 0)?'-':'+',
	   abs(frag->offset_adjust), state->name, state->size);

      if (!rela)
	{
	  RDBG(": no reloc, ignoring\n");
	  continue;
	}

      BFD_ASSERT((unsigned int)(rela - relocs) < sec->reloc_count);
      BFD_ASSERT(state != RS_NONE);

      r_offset = rela->r_offset + frag->offset_adjust;
      addr = sec->output_section->vma + sec->output_offset + r_offset;

      switch (frag->state)
	{
	case RS_ALIGN:
	  size_adjust = ((addr + (1 << rela->r_addend) - 1)
			 & ~((1 << rela->r_addend) - 1));
	  size_adjust -= (sec->output_section->vma + sec->output_offset
			  + frag->offset + frag->offset_adjust
			  + frag->size + frag->size_adjust);

	  RDBG(": adjusting size %lu -> %lu\n", frag->size + frag->size_adjust,
	       frag->size + frag->size_adjust + size_adjust);
	  break;

	case RS_CPENT:
	  if (frag->refcount == 0 && frag->size_adjust == 0)
	    {
	      RDBG(": discarding frag\n");
	      size_adjust = -4;
	    }
	  else if (frag->refcount > 0 && frag->size_adjust < 0)
	    {
	      RDBG(": un-discarding frag\n");
	      size_adjust = 4;
	    }
	  break;

	default:
	  if (rd->reloc_data)
	    r_data = &rd->reloc_data[frag->rela - relocs];

	  /* If this is a cpool reference, we want the symbol that the
	     cpool entry refers to, not the symbol for the cpool entry
	     itself, as we already know what frag it's in.  */
	  if (relax_state[frag->initial_state].reftype == REF_CPOOL)
	    {
	      Elf_Internal_Rela *irela = r_data->add_frag->rela;

