fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
	      r_symndx = ELF_R_SYM(irela->r_info);
	      addend = irela->r_addend;

	      /* The constant pool must be in the same section as the
		 reloc referring to it.  */
	      BFD_ASSERT((unsigned long)(irela - relocs) < sec->reloc_count);

	      ind_data = r_data;
	      r_data = &rd->reloc_data[irela - relocs];
	    }
	  else
	    {
	      r_symndx = ELF_R_SYM(rela->r_info);
	      addend = rela->r_addend;
	    }

	  /* Get the value of the symbol referred to by the reloc.  */
	  if (r_symndx < symtab_hdr->sh_info)
	    {
	      Elf_Internal_Sym *isym;

	      isym = isymbuf + r_symndx;
	      symval = 0;

	      RDBG(" local sym %lu: ", r_symndx);

	      if (isym->st_shndx == SHN_UNDEF)
		defined = FALSE;
	      else if (isym->st_shndx == SHN_ABS)
		sym_sec = bfd_abs_section_ptr;
	      else if (isym->st_shndx == SHN_COMMON)
		sym_sec = bfd_com_section_ptr;
	      else
		sym_sec = bfd_section_from_elf_index(abfd, isym->st_shndx);

	      symval = isym->st_value;
	      sym_type = ELF_ST_TYPE(isym->st_info);
	      target_frag = local_sym_frag[r_symndx];

	      if (local_got_ents)
		got = local_got_ents[r_symndx];
	      else
		got = NULL;
	    }
	  else
	    {
	      /* Global symbol */
	      unsigned long index;
	      struct elf_link_hash_entry *h;
	      struct elf_avr32_link_hash_entry *havr;

	      index = r_symndx - symtab_hdr->sh_info;
	      h = elf_sym_hashes(abfd)[index];
	      BFD_ASSERT(h != NULL);

	      while (h->root.type == bfd_link_hash_indirect
		     || h->root.type == bfd_link_hash_warning)
		h = (struct elf_link_hash_entry *)h->root.u.i.link;

	      havr = (struct elf_avr32_link_hash_entry *)h;
	      got = h->got.glist;

	      symval = 0;

	      RDBG(" %s: ", h->root.root.string);

	      if (h->root.type != bfd_link_hash_defined
		  && h->root.type != bfd_link_hash_defweak)
		{
		  RDBG("(undef)");
		  defined = FALSE;
		}
	      else if ((info->shared && !info->symbolic && h->dynindx != -1)
		       || (htab->root.dynamic_sections_created
			   && h->def_dynamic && !h->def_regular))
		{
		  RDBG("(dynamic)");
		  dynamic = TRUE;
		  sym_sec = h->root.u.def.section;
		}
	      else
		{
		  sym_sec = h->root.u.def.section;
		  symval = h->root.u.def.value;
		  target_frag = havr->sym_frag;
		}

	      sym_type = h->type;
	    }

	  /* Thanks to elf32-ppc for this one.  */
	  if (sym_sec && sym_sec->sec_info_type == ELF_INFO_TYPE_MERGE)
	    {
	      /* At this stage in linking, no SEC_MERGE symbol has been
		 adjusted, so all references to such symbols need to be
		 passed through _bfd_merged_section_offset.  (Later, in
		 relocate_section, all SEC_MERGE symbols *except* for
		 section symbols have been adjusted.)

	         SEC_MERGE sections are not relaxed by us, as they
	         shouldn't contain any code.  */

	      BFD_ASSERT(!target_frag && !(r_data && r_data->add_frag));

	      /* gas may reduce relocations against symbols in SEC_MERGE
		 sections to a relocation against the section symbol when
		 the original addend was zero.  When the reloc is against
		 a section symbol we should include the addend in the
		 offset passed to _bfd_merged_section_offset, since the
		 location of interest is the original symbol.  On the
		 other hand, an access to "sym+addend" where "sym" is not
		 a section symbol should not include the addend;  Such an
		 access is presumed to be an offset from "sym";  The
		 location of interest is just "sym".  */
	      RDBG("\n    MERGE: %s: 0x%lx+0x%lx+0x%lx -> ",
		   (sym_type == STT_SECTION)?"section":"not section",
		   sym_sec->output_section->vma + sym_sec->output_offset,
		   symval, addend);

	      if (sym_type == STT_SECTION)
		symval += addend;

	      symval = (_bfd_merged_section_offset
			(abfd, &sym_sec,
			 elf_section_data(sym_sec)->sec_info, symval));

	      if (sym_type != STT_SECTION)
		symval += addend;
	    }
	  else
	    symval += addend;

	  if (defined && !dynamic)
	    {
	      RDBG("0x%lx+0x%lx",
		   sym_sec->output_section->vma + sym_sec->output_offset,
		   symval);
	      symval += sym_sec->output_section->vma + sym_sec->output_offset;
	    }

	  if (r_data && r_data->add_frag)
	    /* If the add_frag pointer is set, it means that this reloc
	       has an addend that may be affected by relaxation.  */
	    target_frag = r_data->add_frag;

	  if (target_frag)
	    {
	      symval += target_frag->offset_adjust;

	      /* If target_frag comes after this frag in the same
		 section, we should assume that it will be moved by
		 the same amount we are.  */
	      if ((target_frag - rd->frag) < (int)rd->frag_count
		  && target_frag > frag)
		symval += delta;
	    }

	  distance = symval - addr;

	  /* First, try to make a direct reference.  If the symbol is
	     dynamic or undefined, we must take care not to change its
	     reference type, that is, we can't make it direct.

	     Also, it seems like some sections may actually be resized
	     after the relaxation code is done, so we can't really
	     trust that our "distance" is correct.  There's really no
	     easy solution to this problem, so we'll just disallow
	     direct references to SEC_DATA sections.

	     Oh, and .bss isn't actually SEC_DATA, so we disallow
	     !SEC_HAS_CONTENTS as well. */
	  if (!dynamic && defined
	      && (htab->direct_data_refs
		  || (!(sym_sec->flags & SEC_DATA)
		      && (sym_sec->flags & SEC_HAS_CONTENTS)))
	      && next_state->direct)
	    {
	      next_state = &relax_state[next_state->direct];
	      RDBG(" D-> %s", next_state->name);
	    }

	  /* Iterate backwards until we find a state that fits.  */
	  while (next_state->prev
		 && !rs_is_good_enough(next_state, frag, symval, addr,
				       got, ind_data, delta))
	    {
	      next_state = &relax_state[next_state->prev];
	      RDBG(" P-> %s", next_state->name);
	    }

	  /* Then try to find the best possible state.  */
	  while (next_state->next)
	    {
	      const struct relax_state *candidate;

	      candidate = &relax_state[next_state->next];
	      if (!rs_is_good_enough(candidate, frag, symval, addr, got,
				     ind_data, delta))
		break;

	      next_state = candidate;
	      RDBG(" N-> %s", next_state->name);
	    }

