fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
	  RDBG(" [size %ld]\n", next_state->size);

	  BFD_ASSERT(next_state->id);
	  BFD_ASSERT(!dynamic || next_state->reftype == REF_GOT);

	  size_adjust = next_state->size - state->size;

	  /* There's a theoretical possibility that shrinking one frag
	     may cause another to grow, which may cause the first one to
	     grow as well, and we're back where we started.  Avoid this
	     scenario by disallowing a frag that has grown to ever
	     shrink again.  */
	  if (state->reftype == REF_GOT && next_state->reftype != REF_GOT)
	    {
	      if (frag->has_grown)
		next_state = state;
	      else
		unref_got_entry(htab, got);
	    }
	  else if (state->reftype != REF_GOT && next_state->reftype == REF_GOT)
	    {
	      ref_got_entry(htab, got);
	      frag->has_grown = TRUE;
	    }
	  else if (state->reftype == REF_CPOOL
		   && next_state->reftype != REF_CPOOL)
	    {
	      if (frag->has_grown)
		next_state = state;
	      else
		ind_data->add_frag->refcount--;
	    }
	  else if (state->reftype != REF_CPOOL
		   && next_state->reftype == REF_CPOOL)
	    {
	      ind_data->add_frag->refcount++;
	      frag->has_grown = TRUE;
	    }
	  else
	    {
	      if (frag->has_grown && size_adjust < 0)
		next_state = state;
	      else if (size_adjust > 0)
		frag->has_grown = TRUE;
	    }

	  size_adjust = next_state->size - state->size;
	  frag->state = next_state->id;

	  break;
	}

      if (size_adjust)
	htab->repeat_pass = TRUE;

      frag->size_adjust += size_adjust;
      sec->size += size_adjust;
      delta += size_adjust;

      BFD_ASSERT((frag->offset + frag->offset_adjust
		  + frag->size + frag->size_adjust)
		 == (frag[1].offset + frag[1].offset_adjust + delta));
    }

  ret = TRUE;

 out:
  release_local_syms(abfd, isymbuf);
  release_internal_relocs(sec, relocs);
  return ret;
}

static bfd_boolean
adjust_global_symbol(struct elf_avr32_link_hash_entry *havr,
		     struct bfd_link_info *info ATTRIBUTE_UNUSED)
{
  struct elf_link_hash_entry *h = &havr->root;

  if (havr->sym_frag && (h->root.type == bfd_link_hash_defined
			 || h->root.type == bfd_link_hash_defweak))
    {
      RDBG("adjust_global_symbol: %s 0x%08lx -> 0x%08lx\n",
	   h->root.root.string, h->root.u.def.value,
	   h->root.u.def.value + havr->sym_frag->offset_adjust);
      h->root.u.def.value += havr->sym_frag->offset_adjust;
    }
  return TRUE;
}

static bfd_boolean
adjust_syms(struct bfd_link_info *info)
{
  struct elf_avr32_link_hash_table *htab;
  bfd *abfd;

  htab = avr32_elf_hash_table(info);
  elf_link_hash_traverse(&htab->root, adjust_global_symbol, info);

  for (abfd = info->input_bfds; abfd; abfd = abfd->link_next)
    {
      Elf_Internal_Sym *isymbuf;
      struct fragment **local_sym_frag, *frag;
      unsigned int i, sym_count;

      sym_count = elf_tdata(abfd)->symtab_hdr.sh_info;
      if (sym_count == 0)
	continue;

      isymbuf = retrieve_local_syms(abfd, info->keep_memory);
      if (!isymbuf)
	return FALSE;

      local_sym_frag = elf_tdata(abfd)->local_sym_frag;

      for (i = 0; i < sym_count; i++)
	{
	  frag = local_sym_frag[i];
	  if (frag)
	    {
	      RDBG("adjust_local_symbol: %s[%u] 0x%08lx -> 0x%08lx\n",
		   abfd->filename, i, isymbuf[i].st_value,
		   isymbuf[i].st_value + frag->offset_adjust);
	      isymbuf[i].st_value += frag->offset_adjust;
	    }
	}

      release_local_syms(abfd, isymbuf);
    }

  htab->symbols_adjusted = TRUE;
  return TRUE;
}

static bfd_boolean
adjust_relocs(bfd *abfd, asection *sec, struct bfd_link_info *info)
{
  struct avr32_relax_data *rd;
  Elf_Internal_Rela *relocs;
  Elf_Internal_Shdr *symtab_hdr;
  unsigned int i;
  bfd_boolean ret = FALSE;

  rd = avr32_relax_data(sec);
  if (!rd->reloc_data)
    return TRUE;

  RDBG("adjust_relocs: %s<%s> (count: %u)\n", abfd->filename, sec->name,
       sec->reloc_count);

  relocs = retrieve_internal_relocs(abfd, sec, info->keep_memory);
  if (!relocs)
    return FALSE;

  symtab_hdr = &elf_tdata(abfd)->symtab_hdr;

  for (i = 0; i < sec->reloc_count; i++)
    {
      Elf_Internal_Rela *rela = &relocs[i];
      struct avr32_reloc_data *r_data = &rd->reloc_data[i];
      struct fragment *sym_frag;
      unsigned long r_symndx;

      if (r_data->add_frag)
	{
	  r_symndx = ELF_R_SYM(rela->r_info);

	  if (r_symndx < symtab_hdr->sh_info)
	    sym_frag = elf_tdata(abfd)->local_sym_frag[r_symndx];
	  else
	    {
	      struct elf_link_hash_entry *h;

	      h = elf_sym_hashes(abfd)[r_symndx - symtab_hdr->sh_info];

	      while (h->root.type == bfd_link_hash_indirect
		     || h->root.type == bfd_link_hash_warning)
		h = (struct elf_link_hash_entry *)h->root.u.i.link;

	      BFD_ASSERT(h->root.type == bfd_link_hash_defined
			 || h->root.type == bfd_link_hash_defweak);

	      sym_frag = ((struct elf_avr32_link_hash_entry *)h)->sym_frag;
	    }

	  RDBG("    addend: 0x%08lx -> 0x%08lx\n",
	       rela->r_addend,
	       rela->r_addend + r_data->add_frag->offset_adjust
	       - (sym_frag ? sym_frag->offset_adjust : 0));

	  /* If this is against a section symbol, we won't find any
	     sym_frag, so we'll just adjust the addend.  */
	  rela->r_addend += r_data->add_frag->offset_adjust;
	  if (sym_frag)
	    rela->r_addend -= sym_frag->offset_adjust;

	  if (r_data->sub_frag)
	    {
	      bfd_byte *contents;
	      bfd_signed_vma diff;

	      contents = retrieve_contents(abfd, sec, info->keep_memory);
	      if (!contents)
		goto out;

	      /* I realize now that sub_frag is misnamed.  It's
		 actually add_frag which is subtracted in this
		 case...  */
	      diff = bfd_get_signed_32(abfd, contents + rela->r_offset);
	      diff += (r_data->sub_frag->offset_adjust
		       - r_data->add_frag->offset_adjust);
	      bfd_put_32(abfd, diff, contents + rela->r_offset);

	      RDBG("   0x%lx: DIFF32 updated: 0x%lx\n", rela->r_offset, diff);

	      release_contents(sec, contents);
	    }
	}
      else
	BFD_ASSERT(!r_data->sub_frag);
    }

  ret = TRUE;

 out:
  release_internal_relocs(sec, relocs);
  return ret;
}

static bfd_boolean
avr32_move_data(bfd *abfd, asection *sec, struct bfd_link_info *info)
{
  struct elf_avr32_link_hash_table *htab;
  struct avr32_relax_data *rd;
  struct fragment *frag, *fragend;
  Elf_Internal_Rela *relocs = NULL;
  bfd_byte *contents = NULL;
  unsigned int i;
  bfd_boolean ret = FALSE;

  htab = avr32_elf_hash_table(info);
  rd = avr32_relax_data(sec);

  if (!htab->symbols_adjusted)
    if (!adjust_syms(info))
      return FALSE;

