fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
  if (rd->is_relaxable)
    {
      /* Resize the section first, so that we can be sure that enough
	 memory is allocated in case the section has grown.  */
      if (sec->size > sec->rawsize
	  && elf_section_data(sec)->this_hdr.contents)
	{
	  /* We must not use cached data if the section has grown.  */
	  free(elf_section_data(sec)->this_hdr.contents);
	  elf_section_data(sec)->this_hdr.contents = NULL;
	}

      relocs = retrieve_internal_relocs(abfd, sec, info->keep_memory);
      if (!relocs)
	goto out;
      contents = retrieve_contents(abfd, sec, info->keep_memory);
      if (!contents)
	goto out;

      fragend = rd->frag + rd->frag_count;

      RDBG("move_data: %s<%s>: relocs=%p, contents=%p\n",
	   abfd->filename, sec->name, relocs, contents);

      /* First, move the data into place. We must take care to move
	 frags in the right order so that we don't accidentally
	 overwrite parts of the next frag.  */
      for (frag = rd->frag; frag < fragend; frag++)
	{
	  RDBG("    0x%08lx%c0x%x: size 0x%lx%c0x%x\n",
	       frag->offset, frag->offset_adjust >= 0 ? '+' : '-',
	       abs(frag->offset_adjust),
	       frag->size, frag->size_adjust >= 0 ? '+' : '-',
	       abs(frag->size_adjust));
	  if (frag->offset_adjust > 0)
	    {
	      struct fragment *prev = frag - 1;
	      struct fragment *last;

	      for (last = frag; last < fragend && last->offset_adjust > 0;
		   last++) ;

	      if (last == fragend)
		last--;

	      for (frag = last; frag != prev; frag--)
		{
		  if (frag->offset_adjust
		      && frag->size + frag->size_adjust > 0)
		    {
		      RDBG("memmove 0x%lx -> 0x%lx (size %lu)\n",
			   frag->offset, frag->offset + frag->offset_adjust,
			   frag->size + frag->size_adjust);
		      memmove(contents + frag->offset + frag->offset_adjust,
			      contents + frag->offset,
			      frag->size + frag->size_adjust);
		    }
		}
	      frag = last;
	    }
	  else if (frag->offset_adjust && frag->size + frag->size_adjust > 0)
	    {
	      RDBG("memmove 0x%lx -> 0x%lx (size %lu)\n",
		   frag->offset, frag->offset + frag->offset_adjust,
		   frag->size + frag->size_adjust);
	      memmove(contents + frag->offset + frag->offset_adjust,
		      contents + frag->offset,
		      frag->size + frag->size_adjust);
	    }
	}

      i = 0;

      for (frag = rd->frag; frag < fragend; frag++)
	{
	  const struct relax_state *state, *istate;
	  struct avr32_reloc_data *r_data = NULL;

	  istate = &relax_state[frag->initial_state];
	  state = &relax_state[frag->state];

	  if (rd->reloc_data)
	    r_data = &rd->reloc_data[frag->rela - relocs];

	  BFD_ASSERT((long)(frag->size + frag->size_adjust) >= 0);
	  BFD_ASSERT(state->reftype != REF_CPOOL
		     || r_data->add_frag->refcount > 0);

	  if (istate->reftype == REF_CPOOL && state->reftype != REF_CPOOL)
	    {
	      struct fragment *ifrag;

	      /* An indirect reference through the cpool has been
		 converted to a direct reference.  We must update the
		 reloc to point to the symbol itself instead of the
		 constant pool entry.  The reloc type will be updated
		 later.  */
	      ifrag = r_data->add_frag;
	      frag->rela->r_info = ifrag->rela->r_info;
	      frag->rela->r_addend = ifrag->rela->r_addend;

	      /* Copy the reloc data so the addend will be adjusted
		 correctly later.  */
	      *r_data = rd->reloc_data[ifrag->rela - relocs];
	    }

	  /* Move all relocs covered by this frag.  */
	  if (frag->rela)
	    BFD_ASSERT(&relocs[i] <= frag->rela);
	  else
	    BFD_ASSERT((frag + 1) == fragend && frag->state == RS_NONE);

	  if (frag == rd->frag)
	    BFD_ASSERT(i == 0);
	  else
	    BFD_ASSERT(&relocs[i] > frag[-1].rela);

	  /* If non-null, frag->rela is the last relocation in the
	     fragment.  frag->rela can only be null in the last
	     fragment, so in that case, we'll just do the rest.  */
	  for (; (i < sec->reloc_count
		  && (!frag->rela || &relocs[i] <= frag->rela)); i++)
	    {
	      RDBG("[%4u] r_offset 0x%08lx -> 0x%08lx\n", i, relocs[i].r_offset,
		   relocs[i].r_offset + frag->offset_adjust);
	      relocs[i].r_offset += frag->offset_adjust;
	    }

	  if (frag->refcount == 0)
	    {
	      /* If this frag is to be discarded, make sure we won't
		 relocate it later on.  */
	      BFD_ASSERT(frag->state == RS_CPENT);
	      frag->rela->r_info = ELF_R_INFO(ELF_R_SYM(frag->rela->r_info),
					    R_AVR32_NONE);
	    }
	  else if (frag->state == RS_ALIGN)
	    {
	      bfd_vma addr, addr_end;

	      addr = frag->rela->r_offset;
	      addr_end = (frag->offset + frag->offset_adjust
			  + frag->size + frag->size_adjust);

	      /* If the section is executable, insert NOPs.
		 Otherwise, insert zeroes.  */
	      if (sec->flags & SEC_CODE)
		{
		  if (addr & 1)
		    {
		      bfd_put_8(abfd, 0, contents + addr);
		      addr++;
		    }

		  BFD_ASSERT(!((addr_end - addr) & 1));

		  while (addr < addr_end)
		    {
		      bfd_put_16(abfd, NOP_OPCODE, contents + addr);
		      addr += 2;
		    }
		}
	      else
		memset(contents + addr, 0, addr_end - addr);
	    }
	  else if (state->opcode_mask)
	    {
	      bfd_vma insn;

	      /* Update the opcode and the relocation type unless it's a
		 "special" relax state (i.e. RS_NONE, RS_ALIGN or
		 RS_CPENT.), in which case the opcode mask is zero.  */
	      insn = bfd_get_32(abfd, contents + frag->rela->r_offset);
	      insn &= ~state->opcode_mask;
	      insn |= state->opcode;
	      RDBG("    0x%lx: inserting insn %08lx\n",
		   frag->rela->r_offset, insn);
	      bfd_put_32(abfd, insn, contents + frag->rela->r_offset);

	      frag->rela->r_info = ELF_R_INFO(ELF_R_SYM(frag->rela->r_info),
					      state->r_type);
	    }

	  if ((frag + 1) == fragend)
	    BFD_ASSERT((frag->offset + frag->size + frag->offset_adjust
			+ frag->size_adjust) == sec->size);
	  else
	    BFD_ASSERT((frag->offset + frag->size + frag->offset_adjust
			+ frag->size_adjust)
		       == (frag[1].offset + frag[1].offset_adjust));
	}
    }

  /* Adjust reloc addends and DIFF32 differences */
  if (!adjust_relocs(abfd, sec, info))
    return FALSE;

