fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
  ret = TRUE;

 out:
  release_contents(sec, contents);
  release_internal_relocs(sec, relocs);
  return ret;
}

static bfd_boolean
avr32_elf_relax_section(bfd *abfd, asection *sec,
			struct bfd_link_info *info, bfd_boolean *again)
{
  struct elf_avr32_link_hash_table *htab;
  struct avr32_relax_data *rd;

  *again = FALSE;
  if (info->relocatable)
    return TRUE;

  htab = avr32_elf_hash_table(info);
  if ((!(sec->flags & SEC_RELOC) || sec->reloc_count == 0)
      && sec != htab->sgot)
    return TRUE;

  if (!htab->relocations_analyzed)
    {
      if (!analyze_relocations(info))
	return FALSE;
      htab->relocations_analyzed = TRUE;
    }

  rd = avr32_relax_data(sec);

  if (rd->iteration != htab->relax_iteration)
    {
      if (!htab->repeat_pass)
	htab->relax_pass++;
      htab->relax_iteration++;
      htab->repeat_pass = FALSE;
    }

  rd->iteration++;

  switch (htab->relax_pass)
    {
    case RELAX_PASS_SIZE_FRAGS:
      if (!avr32_size_frags(abfd, sec, info))
	return FALSE;
      *again = TRUE;
      break;
    case RELAX_PASS_MOVE_DATA:
      if (!avr32_move_data(abfd, sec, info))
	return FALSE;
      break;
  }

  return TRUE;
}


/* Relocation */

static bfd_reloc_status_type
avr32_check_reloc_value(asection *sec, Elf_Internal_Rela *rela,
			bfd_signed_vma relocation, reloc_howto_type *howto);
static bfd_reloc_status_type
avr32_final_link_relocate(reloc_howto_type *howto, bfd *input_bfd,
			  asection *input_section, bfd_byte *contents,
			  Elf_Internal_Rela *rel, bfd_vma value);
static bfd_boolean
avr32_elf_relocate_section(bfd *output_bfd, struct bfd_link_info *info,
			   bfd *input_bfd, asection *input_section,
			   bfd_byte *contents, Elf_Internal_Rela *relocs,
			   Elf_Internal_Sym *local_syms,
			   asection **local_sections);


#define symbol_address(symbol) \
  symbol->value + symbol->section->output_section->vma \
  + symbol->section->output_offset

#define avr32_elf_insert_field(size, field, abfd, reloc_entry, data)	\
  do									\
    {									\
      unsigned long x;							\
      x = bfd_get_##size (abfd, data + reloc_entry->address);		\
      x &= ~reloc_entry->howto->dst_mask;				\
      x |= field & reloc_entry->howto->dst_mask;			\
      bfd_put_##size (abfd, (bfd_vma) x, data + reloc_entry->address);	\
    }									\
  while(0)

static bfd_reloc_status_type
avr32_check_reloc_value(asection *sec ATTRIBUTE_UNUSED,
			Elf_Internal_Rela *rela ATTRIBUTE_UNUSED,
			bfd_signed_vma relocation,
			reloc_howto_type *howto)
{
  bfd_vma reloc_u;

  /* We take "complain_overflow_dont" to mean "don't complain on
     alignment either". This way, we don't have to special-case
     R_AVR32_HI16 */
  if (howto->complain_on_overflow == complain_overflow_dont)
    return bfd_reloc_ok;

  /* Check if the value is correctly aligned */
  if (relocation & ((1 << howto->rightshift) - 1))
    {
      RDBG("misaligned: %s<%s+%lx>: %s: 0x%lx (align %u)\n",
	   sec->owner->filename, sec->name, rela->r_offset,
	   howto->name, relocation, howto->rightshift);
      return bfd_reloc_overflow;
    }

  /* Now, get rid of the unnecessary bits */
  relocation >>= howto->rightshift;
  reloc_u = (bfd_vma)relocation;

  switch (howto->complain_on_overflow)
    {
    case complain_overflow_unsigned:
    case complain_overflow_bitfield:
      if (reloc_u > (unsigned long)((1 << howto->bitsize) - 1))
	{
	  RDBG("unsigned overflow: %s<%s+%lx>: %s: 0x%lx (size %u)\n",
	       sec->owner->filename, sec->name, rela->r_offset,
	       howto->name, reloc_u, howto->bitsize);
	  RDBG("reloc vma: 0x%lx\n",
	       sec->output_section->vma + sec->output_offset + rela->r_offset);

	  return bfd_reloc_overflow;
	}
      break;
    case complain_overflow_signed:
      if (relocation > (1 << (howto->bitsize - 1)) - 1)
	{
	  RDBG("signed overflow: %s<%s+%lx>: %s: 0x%lx (size %u)\n",
	       sec->owner->filename, sec->name, rela->r_offset,
	       howto->name, reloc_u, howto->bitsize);
	  RDBG("reloc vma: 0x%lx\n",
	       sec->output_section->vma + sec->output_offset + rela->r_offset);

	  return bfd_reloc_overflow;
	}
      if (relocation < -(1 << (howto->bitsize - 1)))
	{
	  RDBG("signed overflow: %s<%s+%lx>: %s: -0x%lx (size %u)\n",
	       sec->owner->filename, sec->name, rela->r_offset,
	       howto->name, -relocation, howto->bitsize);
	  RDBG("reloc vma: 0x%lx\n",
	       sec->output_section->vma + sec->output_offset + rela->r_offset);

	  return bfd_reloc_overflow;
	}
      break;
    default:
      abort();
    }

  return bfd_reloc_ok;
}


static bfd_reloc_status_type
avr32_final_link_relocate(reloc_howto_type *howto,
			  bfd *input_bfd,
			  asection *input_section,
			  bfd_byte *contents,
			  Elf_Internal_Rela *rel,
			  bfd_vma value)
{
  bfd_vma field;
  bfd_vma relocation;
  bfd_reloc_status_type status;
  bfd_byte *p = contents + rel->r_offset;
  unsigned long x;

  pr_debug("  (6b) final link relocate\n");

  /* Sanity check the address */
  if (rel->r_offset > input_section->size)
    {
      (*_bfd_error_handler)
	("%B: %A+0x%lx: offset out of range (section size: 0x%lx)",
	 input_bfd, input_section, rel->r_offset, input_section->size);
      return bfd_reloc_outofrange;
    }

  relocation = value + rel->r_addend;

  if (howto->pc_relative)
    {
      bfd_vma addr;

      addr = input_section->output_section->vma
	+ input_section->output_offset + rel->r_offset;
      addr &= ~0UL << howto->rightshift;
      relocation -= addr;
    }

  switch (ELF32_R_TYPE(rel->r_info))
    {
    case R_AVR32_16N_PCREL:
      /* sub reg, pc, . - (sym + addend) */
      relocation = -relocation;
      break;
    }

  status = avr32_check_reloc_value(input_section, rel, relocation, howto);

  relocation >>= howto->rightshift;
  if (howto->bitsize == 21)
    field = (relocation & 0xffff)
      | ((relocation & 0x10000) << 4)
      | ((relocation & 0x1e0000) << 8);
  else if (howto->bitsize == 12)
    field = (relocation & 0xff) | ((relocation & 0xf00) << 4);
  else if (howto->bitsize == 10)
    field = ((relocation & 0xff) << 4)
      | ((relocation & 0x300) >> 8);
  else
    field = relocation << howto->bitpos;

  switch (howto->size)
    {
    case 0:
      x = bfd_get_8 (input_bfd, p);
      x &= ~howto->dst_mask;
      x |= field & howto->dst_mask;
      bfd_put_8 (input_bfd, (bfd_vma) x, p);
      break;
    case 1:
      x = bfd_get_16 (input_bfd, p);
      x &= ~howto->dst_mask;
      x |= field & howto->dst_mask;
      bfd_put_16 (input_bfd, (bfd_vma) x, p);
      break;
    case 2:
      x = bfd_get_32 (input_bfd, p);
      x &= ~howto->dst_mask;
      x |= field & howto->dst_mask;
      bfd_put_32 (input_bfd, (bfd_vma) x, p);
      break;
    default:
      abort();
    }

