fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
  return status;
}

/* (6) Apply relocations to the normal (non-dynamic) sections */

static bfd_boolean
avr32_elf_relocate_section(bfd *output_bfd, struct bfd_link_info *info,
			   bfd *input_bfd, asection *input_section,
			   bfd_byte *contents, Elf_Internal_Rela *relocs,
			   Elf_Internal_Sym *local_syms,
			   asection **local_sections)
{
  struct elf_avr32_link_hash_table *htab;
  Elf_Internal_Shdr *symtab_hdr;
  Elf_Internal_Rela *rel, *relend;
  struct elf_link_hash_entry **sym_hashes;
  struct got_entry **local_got_ents;
  asection *sgot;
  asection *srelgot;

  pr_debug("(6) relocate section %s:<%s> (size 0x%lx)\n",
	   input_bfd->filename, input_section->name, input_section->size);

  /* If we're doing a partial link, we don't have to do anything since
     we're using RELA relocations */
  if (info->relocatable)
    return TRUE;

  htab = avr32_elf_hash_table(info);
  symtab_hdr = &elf_tdata(input_bfd)->symtab_hdr;
  sym_hashes = elf_sym_hashes(input_bfd);
  local_got_ents = elf_local_got_ents(input_bfd);
  sgot = htab->sgot;
  srelgot = htab->srelgot;

  relend = relocs + input_section->reloc_count;
  for (rel = relocs; rel < relend; rel++)
    {
      unsigned long r_type, r_symndx;
      reloc_howto_type *howto;
      Elf_Internal_Sym *sym = NULL;
      struct elf_link_hash_entry *h = NULL;
      asection *sec = NULL;
      bfd_vma value;
      bfd_vma offset;
      bfd_reloc_status_type status;

      r_type = ELF32_R_TYPE(rel->r_info);
      r_symndx = ELF32_R_SYM(rel->r_info);

      if (r_type == R_AVR32_NONE
	  || r_type == R_AVR32_ALIGN
	  || r_type == R_AVR32_DIFF32
	  || r_type == R_AVR32_DIFF16
	  || r_type == R_AVR32_DIFF8)
	continue;

      /* Sanity check */
      if (r_type > R_AVR32_max)
	{
	  bfd_set_error(bfd_error_bad_value);
	  return FALSE;
	}

      howto = &elf_avr32_howto_table[r_type];

      if (r_symndx < symtab_hdr->sh_info)
	{
	  sym = local_syms + r_symndx;
	  sec = local_sections[r_symndx];

	  pr_debug("  (6a) processing %s against local symbol %lu\n",
		   howto->name, r_symndx);

	  /* The following function changes rel->r_addend behind our back. */
	  value = _bfd_elf_rela_local_sym(output_bfd, sym, &sec, rel);
	  pr_debug("    => value: %lx, addend: %lx\n", value, rel->r_addend);
	}
      else
	{
	  if (sym_hashes == NULL)
	    return FALSE;

	  h = sym_hashes[r_symndx - symtab_hdr->sh_info];
	  while (h->root.type == bfd_link_hash_indirect
		 || h->root.type == bfd_link_hash_warning)
	    h = (struct elf_link_hash_entry *)h->root.u.i.link;

	  pr_debug("  (6a) processing %s against symbol %s\n",
		   howto->name, h->root.root.string);

	  if (h->root.type == bfd_link_hash_defined
	      || h->root.type == bfd_link_hash_defweak)
	    {
	      bfd_boolean dyn;

	      dyn = htab->root.dynamic_sections_created;
	      sec = h->root.u.def.section;

	      if (sec->output_section)
		value = (h->root.u.def.value
			 + sec->output_section->vma
			 + sec->output_offset);
	      else
		value = h->root.u.def.value;
	    }
	  else if (h->root.type == bfd_link_hash_undefweak)
	    value = 0;
	  else if (info->unresolved_syms_in_objects == RM_IGNORE
		   && ELF_ST_VISIBILITY(h->other) == STV_DEFAULT)
	    value = 0;
	  else
	    {
	      bfd_boolean err;
	      err = (info->unresolved_syms_in_objects == RM_GENERATE_ERROR
		     || ELF_ST_VISIBILITY(h->other) != STV_DEFAULT);
	      if (!info->callbacks->undefined_symbol
		  (info, h->root.root.string, input_bfd,
		   input_section, rel->r_offset, err))
		return FALSE;
	      value = 0;
	    }

	  pr_debug("    => value: %lx, addend: %lx\n", value, rel->r_addend);
	}

      switch (r_type)
	{
	case R_AVR32_GOT32:
	case R_AVR32_GOT16:
	case R_AVR32_GOT8:
	case R_AVR32_GOT21S:
	case R_AVR32_GOT18SW:
	case R_AVR32_GOT16S:
	case R_AVR32_GOT7UW:
	case R_AVR32_LDA_GOT:
	case R_AVR32_GOTCALL:
	  BFD_ASSERT(sgot != NULL);

	  if (h != NULL)
	    {
	      BFD_ASSERT(h->got.glist->refcount > 0);
	      offset = h->got.glist->offset;

	      BFD_ASSERT(offset < sgot->size);
	      if (!elf_hash_table(info)->dynamic_sections_created
		  || (h->def_regular
		      && (!info->shared
			  || info->symbolic
			  || h->dynindx == -1)))
		{
		  /* This is actually a static link, or it is a
		     -Bsymbolic link and the symbol is defined
		     locally, or the symbol was forced to be local.  */
		  bfd_put_32(output_bfd, value, sgot->contents + offset);
		}
	    }
	  else
	    {
	      BFD_ASSERT(local_got_ents &&
			 local_got_ents[r_symndx]->refcount > 0);
	      offset = local_got_ents[r_symndx]->offset;

	      /* Local GOT entries don't have relocs.  If this is a
		 shared library, the dynamic linker will add the load
		 address to the initial value at startup.  */
	      BFD_ASSERT(offset < sgot->size);
	      pr_debug("Initializing GOT entry at offset %lu: 0x%lx\n",
		       offset, value);
	      bfd_put_32 (output_bfd, value, sgot->contents + offset);
	    }

	  value = sgot->output_offset + offset;
	  pr_debug("GOT reference: New value %lx\n", value);
	  break;

	case R_AVR32_GOTPC:
	  /* This relocation type is for constant pool entries used in
	     the calculation "Rd = PC - (PC - GOT)", where the
	     constant pool supplies the constant (PC - GOT)
	     offset. The symbol value + addend indicates where the
	     value of PC is taken. */
	  value -= sgot->output_section->vma;
	  break;

	case R_AVR32_32_PCREL:
	  /* We must adjust r_offset to account for discarded data in
	     the .eh_frame section.  This is probably not the right
	     way to do this, since AFAICS all other architectures do
	     it some other way.  I just can't figure out how...  */
	  {
	    bfd_vma r_offset;

	    r_offset = _bfd_elf_section_offset(output_bfd, info,
					       input_section,
					       rel->r_offset);
	    if (r_offset == (bfd_vma)-1
		|| r_offset == (bfd_vma)-2)
	      continue;
	    rel->r_offset = r_offset;
	  }
	  break;

	case R_AVR32_32:
	  /* We need to emit a run-time relocation in the following cases:
	       - we're creating a shared library
	       - the symbol is not defined in any regular objects

	     Of course, sections that aren't going to be part of the
	     run-time image will not get any relocs, and undefined
	     symbols won't have any either (only weak undefined
	     symbols should get this far).  */
	  if ((info->shared
	       || (elf_hash_table(info)->dynamic_sections_created
		   && h != NULL
		   && h->def_dynamic
		   && !h->def_regular))
	      && r_symndx != 0
	      && (input_section->flags & SEC_ALLOC))
	    {
	      Elf_Internal_Rela outrel;
	      bfd_byte *loc;
	      bfd_boolean skip, relocate;
	      struct elf_avr32_link_hash_entry *avrh;

	      pr_debug("Going to generate dynamic reloc...\n");

