fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
	      skip = FALSE;
	      relocate = FALSE;

	      outrel.r_offset = _bfd_elf_section_offset(output_bfd, info,
							input_section,
							rel->r_offset);
	      if (outrel.r_offset == (bfd_vma)-1)
		skip = TRUE;
	      else if (outrel.r_offset == (bfd_vma)-2)
		skip = TRUE, relocate = TRUE;

	      outrel.r_offset += (input_section->output_section->vma
				  + input_section->output_offset);

	      pr_debug("    ... offset %lx, dynindx %ld\n",
		       outrel.r_offset, h ? h->dynindx : -1);

	      if (skip)
		memset(&outrel, 0, sizeof(outrel));
	      else
		{
		  avrh = (struct elf_avr32_link_hash_entry *)h;
		  /* h->dynindx may be -1 if this symbol was marked to
		     become local.  */
		  if (h == NULL
		      || ((info->symbolic || h->dynindx == -1)
			  && h->def_regular))
		    {
		      relocate = TRUE;
		      outrel.r_info = ELF32_R_INFO(0, R_AVR32_RELATIVE);
		      outrel.r_addend = value + rel->r_addend;
		      pr_debug("    ... R_AVR32_RELATIVE\n");
		    }
		  else
		    {
		      BFD_ASSERT(h->dynindx != -1);
		      relocate = TRUE;
		      outrel.r_info = ELF32_R_INFO(h->dynindx, R_AVR32_GLOB_DAT);
		      outrel.r_addend = rel->r_addend;
		      pr_debug("    ... R_AVR32_GLOB_DAT\n");
		    }
		}

	      pr_debug("srelgot reloc_count: %d, size %lu\n",
		       srelgot->reloc_count, srelgot->size);

	      loc = srelgot->contents;
	      loc += srelgot->reloc_count++ * sizeof(Elf32_External_Rela);
	      bfd_elf32_swap_reloca_out(output_bfd, &outrel, loc);

	      BFD_ASSERT(srelgot->reloc_count * sizeof(Elf32_External_Rela)
			 <= srelgot->size);

	      if (!relocate)
		continue;
	    }
	  break;
	}

      status = avr32_final_link_relocate(howto, input_bfd, input_section,
					 contents, rel, value);

      switch (status)
	{
	case bfd_reloc_ok:
	  break;

	case bfd_reloc_overflow:
	  {
	    const char *name;

	    if (h != NULL)
	      name = h->root.root.string;
	    else
	      {
		name = bfd_elf_string_from_elf_section(input_bfd,
						       symtab_hdr->sh_link,
						       sym->st_name);
		if (name == NULL)
		  return FALSE;
		if (*name == '\0')
		  name = bfd_section_name(input_bfd, sec);
	      }
	    if (!((*info->callbacks->reloc_overflow)
		  (info, (h ? &h->root : NULL), name, howto->name,
		   rel->r_addend, input_bfd, input_section, rel->r_offset)))
	      return FALSE;
	  }
	  break;

	case bfd_reloc_outofrange:
	default:
	  abort();
	}
    }

  return TRUE;
}


/* Additional processing of dynamic sections after relocation */

static bfd_boolean
avr32_elf_finish_dynamic_symbol(bfd *output_bfd, struct bfd_link_info *info,
				struct elf_link_hash_entry *h,
				Elf_Internal_Sym *sym);
static bfd_boolean
avr32_elf_finish_dynamic_sections(bfd *output_bfd, struct bfd_link_info *info);


/* (7) Initialize the contents of a dynamic symbol and/or emit
   relocations for it */

static bfd_boolean
avr32_elf_finish_dynamic_symbol(bfd *output_bfd, struct bfd_link_info *info,
				struct elf_link_hash_entry *h,
				Elf_Internal_Sym *sym)
{
  struct elf_avr32_link_hash_table *htab;
  struct got_entry *got;

  pr_debug("(7) finish dynamic symbol: %s\n", h->root.root.string);

  htab = avr32_elf_hash_table(info);
  got = h->got.glist;

  if (got && got->refcount > 0)
    {
      asection *sgot;
      asection *srelgot;
      Elf_Internal_Rela rel;
      bfd_byte *loc;

      /* This symbol has an entry in the GOT. Set it up. */
      sgot = htab->sgot;
      srelgot = htab->srelgot;
      BFD_ASSERT(sgot && srelgot);

      rel.r_offset = (sgot->output_section->vma
		      + sgot->output_offset
		      + got->offset);

      /* If this is a static link, or it is a -Bsymbolic link and the
	 symbol is defined locally or was forced to be local because
	 of a version file, we just want to emit a RELATIVE reloc. The
	 entry in the global offset table will already have been
	 initialized in the relocate_section function. */
      if ((info->shared
	   && !info->symbolic
	   && h->dynindx != -1)
	  || (htab->root.dynamic_sections_created
	      && h->def_dynamic
	      && !h->def_regular))
	{
	  bfd_put_32(output_bfd, 0, sgot->contents + got->offset);
	  rel.r_info = ELF32_R_INFO(h->dynindx, R_AVR32_GLOB_DAT);
	  rel.r_addend = 0;

	  pr_debug("GOT reloc R_AVR32_GLOB_DAT, dynindx: %ld\n", h->dynindx);
	  pr_debug("    srelgot reloc_count: %d, size: %lu\n",
		   srelgot->reloc_count, srelgot->size);

	  loc = (srelgot->contents
		 + srelgot->reloc_count++ * sizeof(Elf32_External_Rela));
	  bfd_elf32_swap_reloca_out(output_bfd, &rel, loc);

	  BFD_ASSERT(srelgot->reloc_count * sizeof(Elf32_External_Rela)
		     <= srelgot->size);
	}
    }

  /* Mark _DYNAMIC and _GLOBAL_OFFSET_TABLE_ as absolute */
  if (strcmp(h->root.root.string, "_DYNAMIC") == 0
      || strcmp(h->root.root.string, "_GLOBAL_OFFSET_TABLE_") == 0)
    sym->st_shndx = SHN_ABS;

  return TRUE;
}

/* (8) Do any remaining initialization of the dynamic sections */

static bfd_boolean
avr32_elf_finish_dynamic_sections(bfd *output_bfd, struct bfd_link_info *info)
{
  struct elf_avr32_link_hash_table *htab;
  asection *sgot, *sdyn;

  pr_debug("(8) finish dynamic sections\n");

  htab = avr32_elf_hash_table(info);
  sgot = htab->sgot;
  sdyn = bfd_get_section_by_name(htab->root.dynobj, ".dynamic");

  if (htab->root.dynamic_sections_created)
    {
      Elf32_External_Dyn *dyncon, *dynconend;

      BFD_ASSERT(sdyn && sgot && sgot->size >= AVR32_GOT_HEADER_SIZE);

      dyncon = (Elf32_External_Dyn *)sdyn->contents;
      dynconend = (Elf32_External_Dyn *)(sdyn->contents + sdyn->size);
      for (; dyncon < dynconend; dyncon++)
	{
	  Elf_Internal_Dyn dyn;
	  asection *s;

	  bfd_elf32_swap_dyn_in(htab->root.dynobj, dyncon, &dyn);

	  switch (dyn.d_tag)
	    {
	    default:
	      break;

	    case DT_PLTGOT:
	      s = sgot->output_section;
	      BFD_ASSERT(s != NULL);
	      dyn.d_un.d_ptr = s->vma;
	      bfd_elf32_swap_dyn_out(output_bfd, &dyn, dyncon);
	      break;

	    case DT_AVR32_GOTSZ:
	      s = sgot->output_section;
	      BFD_ASSERT(s != NULL);
	      dyn.d_un.d_val = s->size;
	      bfd_elf32_swap_dyn_out(output_bfd, &dyn, dyncon);
	      break;
	    }
	}

      /* Fill in the first two entries in the global offset table */
      bfd_put_32(output_bfd,
		 sdyn->output_section->vma + sdyn->output_offset,
		 sgot->contents);

      /* The runtime linker will fill this one in with the address of
	 the run-time link map */
      bfd_put_32(output_bfd, 0, sgot->contents + 4);
    }

