fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/bfd/elf32-avr32.c
  if (sgot)
    elf_section_data(sgot->output_section)->this_hdr.sh_entsize = 4;

  return TRUE;
}


/* AVR32-specific private ELF data */

static bfd_boolean
avr32_elf_set_private_flags(bfd *abfd, flagword flags);
static bfd_boolean
avr32_elf_copy_private_bfd_data(bfd *ibfd, bfd *obfd);
static bfd_boolean
avr32_elf_merge_private_bfd_data(bfd *ibfd, bfd *obfd);
static bfd_boolean
avr32_elf_print_private_bfd_data(bfd *abfd, void *ptr);

static bfd_boolean
avr32_elf_set_private_flags(bfd *abfd, flagword flags)
{
  elf_elfheader(abfd)->e_flags = flags;
  elf_flags_init(abfd) = TRUE;

  return TRUE;
}

/* Copy backend specific data from one object module to another.  */

static bfd_boolean
avr32_elf_copy_private_bfd_data(bfd *ibfd, bfd *obfd)
{
  elf_elfheader(obfd)->e_flags = elf_elfheader(ibfd)->e_flags;
  return TRUE;
}

/* Merge backend specific data from an object file to the output
   object file when linking.  */

static bfd_boolean
avr32_elf_merge_private_bfd_data(bfd *ibfd, bfd *obfd)
{
  flagword out_flags, in_flags;

  pr_debug("(0) merge_private_bfd_data: %s -> %s\n",
	   ibfd->filename, obfd->filename);

  in_flags = elf_elfheader(ibfd)->e_flags;
  out_flags = elf_elfheader(obfd)->e_flags;

  if (elf_flags_init(obfd))
    {
      /* If one of the inputs are non-PIC, the output must be
	 considered non-PIC.  The same applies to linkrelax.  */
      if (!(in_flags & EF_AVR32_PIC))
	out_flags &= ~EF_AVR32_PIC;
      if (!(in_flags & EF_AVR32_LINKRELAX))
	out_flags &= ~EF_AVR32_LINKRELAX;
    }
  else
    {
      elf_flags_init(obfd) = TRUE;
      out_flags = in_flags;
    }

  elf_elfheader(obfd)->e_flags = out_flags;

  return TRUE;
}

static bfd_boolean
avr32_elf_print_private_bfd_data(bfd *abfd, void *ptr)
{
  FILE *file = (FILE *)ptr;
  unsigned long flags;

  BFD_ASSERT(abfd != NULL && ptr != NULL);

  _bfd_elf_print_private_bfd_data(abfd, ptr);

  flags = elf_elfheader(abfd)->e_flags;

  fprintf(file, _("private flags = %lx:"), elf_elfheader(abfd)->e_flags);

  if (flags & EF_AVR32_PIC)
    fprintf(file, " [PIC]");
  if (flags & EF_AVR32_LINKRELAX)
    fprintf(file, " [linker relaxable]");

  flags &= ~(EF_AVR32_PIC | EF_AVR32_LINKRELAX);

  if (flags)
    fprintf(file, _("<Unrecognized flag bits set>"));

  fputc('\n', file);

  return TRUE;
}

/* Set avr32-specific linker options.  */
void bfd_elf32_avr32_set_options(struct bfd_link_info *info,
				 int direct_data_refs)
{
  struct elf_avr32_link_hash_table *htab;

  htab = avr32_elf_hash_table (info);
  htab->direct_data_refs = !!direct_data_refs;
}



/* Understanding core dumps */

static bfd_boolean
avr32_elf_grok_prstatus(bfd *abfd, Elf_Internal_Note *note);
static bfd_boolean
avr32_elf_grok_psinfo(bfd *abfd, Elf_Internal_Note *note);

static bfd_boolean
avr32_elf_grok_prstatus(bfd *abfd, Elf_Internal_Note *note)
{
  /* Linux/AVR32B elf_prstatus */
  if (note->descsz != 148)
    return FALSE;

  /* pr_cursig */
  elf_tdata(abfd)->core_signal = bfd_get_16(abfd, note->descdata + 12);

  /* pr_pid */
  elf_tdata(abfd)->core_pid = bfd_get_32(abfd, note->descdata + 24);

  /* Make a ".reg/999" section for pr_reg. The size is for 16
     general-purpose registers, SR and r12_orig (18 * 4 = 72).  */
  return _bfd_elfcore_make_pseudosection(abfd, ".reg", 72,
					 note->descpos + 72);
}

static bfd_boolean
avr32_elf_grok_psinfo(bfd *abfd, Elf_Internal_Note *note)
{
  /* Linux/AVR32B elf_prpsinfo */
  if (note->descsz != 128)
    return FALSE;

  elf_tdata(abfd)->core_program
    = _bfd_elfcore_strndup(abfd, note->descdata + 32, 16);
  elf_tdata(abfd)->core_command
    = _bfd_elfcore_strndup(abfd, note->descdata + 48, 80);

  /* Note that for some reason, a spurious space is tacked
     onto the end of the args in some (at least one anyway)
     implementations, so strip it off if it exists.  */

  {
    char *command = elf_tdata (abfd)->core_command;
    int n = strlen (command);

    if (0 < n && command[n - 1] == ' ')
      command[n - 1] = '\0';
  }

  return TRUE;
}


#define ELF_ARCH			bfd_arch_avr32
#define ELF_MACHINE_CODE		EM_AVR32
#define ELF_MAXPAGESIZE			1024

#define TARGET_BIG_SYM			bfd_elf32_avr32_vec
#define TARGET_BIG_NAME			"elf32-avr32"

#define elf_backend_grok_prstatus	avr32_elf_grok_prstatus
#define elf_backend_grok_psinfo		avr32_elf_grok_psinfo

/* Only RELA relocations are used */
#define elf_backend_may_use_rel_p	0
#define elf_backend_may_use_rela_p	1
#define elf_backend_default_use_rela_p	1
#define elf_backend_rela_normal		1
#define elf_info_to_howto_rel		NULL
#define elf_info_to_howto		avr32_info_to_howto

#define bfd_elf32_bfd_copy_private_bfd_data	avr32_elf_copy_private_bfd_data
#define bfd_elf32_bfd_merge_private_bfd_data	avr32_elf_merge_private_bfd_data
#define bfd_elf32_bfd_set_private_flags		avr32_elf_set_private_flags
#define bfd_elf32_bfd_print_private_bfd_data	avr32_elf_print_private_bfd_data
#define bfd_elf32_new_section_hook		avr32_elf_new_section_hook

#define elf_backend_gc_mark_hook		avr32_elf_gc_mark_hook
#define elf_backend_gc_sweep_hook		avr32_elf_gc_sweep_hook
#define elf_backend_relocate_section	avr32_elf_relocate_section
#define elf_backend_copy_indirect_symbol avr32_elf_copy_indirect_symbol
#define elf_backend_create_dynamic_sections avr32_elf_create_dynamic_sections
#define bfd_elf32_bfd_link_hash_table_create avr32_elf_link_hash_table_create
#define elf_backend_adjust_dynamic_symbol avr32_elf_adjust_dynamic_symbol
#define elf_backend_size_dynamic_sections avr32_elf_size_dynamic_sections
#define elf_backend_finish_dynamic_symbol avr32_elf_finish_dynamic_symbol
#define elf_backend_finish_dynamic_sections avr32_elf_finish_dynamic_sections

#define bfd_elf32_bfd_relax_section	avr32_elf_relax_section

/* Find out which symbols need an entry in .got. */
#define elf_backend_check_relocs	avr32_check_relocs
#define elf_backend_can_refcount	1
#define elf_backend_can_gc_sections	1
#define elf_backend_plt_readonly	1
#define elf_backend_plt_not_loaded	1
#define elf_backend_want_plt_sym	0
#define elf_backend_plt_alignment	2
#define elf_backend_want_dynbss		0
#define elf_backend_want_got_plt	0
#define elf_backend_want_got_sym	1
#define elf_backend_got_header_size	AVR32_GOT_HEADER_SIZE

#include "elf32-target.h"
